una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
/***************************************************************************
 **
 **    This file defines the Special Function Registers for
 **    NXP LPC4310 Cortex-M4 Core
 **
 **    Used with ARM IAR C/C++ Compiler and Assembler.
 **
 **    (c) Copyright IAR Systems 2012
 **
 **    $Revision: 50467 $
 **
 **    Note: Only little endian addressing of 8 bit registers.
 ***************************************************************************/

#ifndef __IOLPC4310_M4_H
#define __IOLPC4310_M4_H

#if (((__TID__ >> 8) & 0x7F) != 0x4F)     /* 0x4F = 79 dec */
#error This file should only be compiled by ARM IAR compiler and assembler
#endif

#include "io_macros.h"

/***************************************************************************
 ***************************************************************************
 **
 **    LPC4310_M4 SPECIAL FUNCTION REGISTERS
 **
 ***************************************************************************
 ***************************************************************************
 ***************************************************************************/

/* C-compiler specific declarations  ***************************************/
#ifdef __IAR_SYSTEMS_ICC__

#ifndef _SYSTEM_BUILD
#pragma system_include
#endif

#if __LITTLE_ENDIAN__ == 0
#error This file should only be compiled in little endian mode
#endif

/* Auxiliary Control Register */
typedef struct {
  __REG32  DISMCYCINT     : 1;
  __REG32  DISDEFWBUF     : 1;
  __REG32  DISFOLD        : 1;
  __REG32                 : 5;
  __REG32  DISFPCA        : 1;
  __REG32  DISOOFP        : 1;
  __REG32                 :22;
} __actlr_bits;

/* Interrupt Controller Type Register */
typedef struct {
  __REG32  INTLINESNUM    : 5;
  __REG32                 :27;
} __nvic_ictr_bits;


/* SysTick Control and Status Register */
typedef struct {
  __REG32  ENABLE         : 1;
  __REG32  TICKINT        : 1;
  __REG32  CLKSOURCE      : 1;
  __REG32                 :13;
  __REG32  COUNTFLAG      : 1;
  __REG32                 :15;
} __systick_csr_bits;

/* SysTick Reload Value Register */
typedef struct {
  __REG32  RELOAD         :24;
  __REG32                 : 8;
} __systick_rvr_bits;

/* SysTick Current Value Register */
typedef struct {
  __REG32  CURRENT        :24;
  __REG32                 : 8;
} __systick_cvr_bits;

/* SysTick Calibration Value Register */
typedef struct {
  __REG32  TENMS          :24;
  __REG32                 : 6;
  __REG32  SKEW           : 1;
  __REG32  NOREF          : 1;
} __systick_calvr_bits;


/* Interrupt Set-Enable Registers 0-31 */
typedef struct {
  __REG32  ISE0        : 1;
  __REG32  ISE1        : 1;
  __REG32  ISE2        : 1;
  __REG32  ISE3        : 1;
  __REG32  ISE4        : 1;
  __REG32  ISE5        : 1;
  __REG32  ISE6        : 1;
  __REG32  ISE7        : 1;
  __REG32  ISE8        : 1;
  __REG32  ISE9        : 1;
  __REG32  ISE10       : 1;
  __REG32  ISE11       : 1;
  __REG32  ISE12       : 1;
  __REG32  ISE13       : 1;
  __REG32  ISE14       : 1;
  __REG32  ISE15       : 1;
  __REG32  ISE16       : 1;
  __REG32  ISE17       : 1;
  __REG32  ISE18       : 1;
  __REG32  ISE19       : 1;
  __REG32  ISE20       : 1;
  __REG32  ISE21       : 1;
  __REG32  ISE22       : 1;
  __REG32  ISE23       : 1;
  __REG32  ISE24       : 1;
  __REG32  ISE25       : 1;
  __REG32  ISE26       : 1;
  __REG32  ISE27       : 1;
  __REG32  ISE28       : 1;
  __REG32  ISE29       : 1;
  __REG32  ISE30       : 1;
  __REG32  ISE31       : 1;
} __nvic_iser0_bits;

/* Interrupt Set-Enable Registers 0-31 */
typedef struct {
  __REG32  ISE32        : 1;
  __REG32  ISE33        : 1;
  __REG32  ISE34        : 1;
  __REG32  ISE35        : 1;
  __REG32  ISE36        : 1;
  __REG32  ISE37        : 1;
  __REG32  ISE38        : 1;
  __REG32  ISE39        : 1;
  __REG32  ISE40        : 1;
  __REG32  ISE41        : 1;
  __REG32  ISE42        : 1;
  __REG32  ISE43        : 1;
  __REG32  ISE44        : 1;
  __REG32  ISE45        : 1;
  __REG32  ISE46        : 1;
  __REG32  ISE47        : 1;
  __REG32  ISE48        : 1;
  __REG32  ISE49        : 1;
  __REG32  ISE50        : 1;
  __REG32  ISE51        : 1;
  __REG32  ISE52        : 1;
  __REG32               :11;
} __nvic_iser1_bits;

/* Interrupt Clear-Enable Registers 0-31 */
typedef struct {
  __REG32  ICE0        : 1;
  __REG32  ICE1        : 1;
  __REG32  ICE2        : 1;
  __REG32  ICE3        : 1;
  __REG32  ICE4        : 1;
  __REG32  ICE5        : 1;
  __REG32  ICE6        : 1;
  __REG32  ICE7        : 1;
  __REG32  ICE8        : 1;
  __REG32  ICE9        : 1;
  __REG32  ICE10       : 1;
  __REG32  ICE11       : 1;
  __REG32  ICE12       : 1;
  __REG32  ICE13       : 1;
  __REG32  ICE14       : 1;
  __REG32  ICE15       : 1;
  __REG32  ICE16       : 1;
  __REG32  ICE17       : 1;
  __REG32  ICE18       : 1;
  __REG32  ICE19       : 1;
  __REG32  ICE20       : 1;
  __REG32  ICE21       : 1;
  __REG32  ICE22       : 1;
  __REG32  ICE23       : 1;
  __REG32  ICE24       : 1;
  __REG32  ICE25       : 1;
  __REG32  ICE26       : 1;
  __REG32  ICE27       : 1;
  __REG32  ICE28       : 1;
  __REG32  ICE29       : 1;
  __REG32  ICE30       : 1;
  __REG32  ICE31       : 1;
} __nvic_icer0_bits;

/* Interrupt Clear-Enable Registers 0-31 */
typedef struct {
  __REG32  ICE32        : 1;
  __REG32  ICE33        : 1;
  __REG32  ICE34        : 1;
  __REG32  ICE35        : 1;
  __REG32  ICE36        : 1;
  __REG32  ICE37        : 1;
  __REG32  ICE38        : 1;
  __REG32  ICE39        : 1;
  __REG32  ICE40        : 1;
  __REG32  ICE41        : 1;
  __REG32  ICE42        : 1;
  __REG32  ICE43        : 1;
  __REG32  ICE44        : 1;
  __REG32  ICE45        : 1;
  __REG32  ICE46        : 1;
  __REG32  ICE47        : 1;
  __REG32  ICE48        : 1;
  __REG32  ICE49        : 1;
  __REG32  ICE50        : 1;
  __REG32  ICE51        : 1;
  __REG32  ICE52        : 1;
  __REG32               :11;
} __nvic_icer1_bits;

/* Interrupt Set-Pending Register 0-31 */
typedef struct {
  __REG32  ISP0        : 1;
  __REG32  ISP1        : 1;
  __REG32  ISP2        : 1;
  __REG32  ISP3        : 1;
  __REG32  ISP4        : 1;
  __REG32  ISP5        : 1;
  __REG32  ISP6        : 1;
  __REG32  ISP7        : 1;
  __REG32  ISP8        : 1;
  __REG32  ISP9        : 1;
  __REG32  ISP10       : 1;
  __REG32  ISP11       : 1;
  __REG32  ISP12       : 1;
  __REG32  ISP13       : 1;
  __REG32  ISP14       : 1;
  __REG32  ISP15       : 1;
  __REG32  ISP16       : 1;
  __REG32  ISP17       : 1;
  __REG32  ISP18       : 1;
  __REG32  ISP19       : 1;
  __REG32  ISP20       : 1;
  __REG32  ISP21       : 1;
  __REG32  ISP22       : 1;
  __REG32  ISP23       : 1;
  __REG32  ISP24       : 1;
  __REG32  ISP25       : 1;
  __REG32  ISP26       : 1;
  __REG32  ISP27       : 1;
  __REG32  ISP28       : 1;
  __REG32  ISP29       : 1;
  __REG32  ISP30       : 1;
  __REG32  ISP31       : 1;
} __nvic_ispr0_bits;

