una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
/* Configurable Fault Status Registers */
typedef struct {
  __REG32  IACCVIOL       : 1;
  __REG32  DACCVIOL       : 1;
  __REG32                 : 1;
  __REG32  MUNSTKERR      : 1;
  __REG32  MSTKERR        : 1;
  __REG32  MLSPERR        : 1;
  __REG32                 : 1;
  __REG32  MMARVALID      : 1;
  __REG32  IBUSERR        : 1;
  __REG32  PRECISERR      : 1;
  __REG32  IMPRECISERR    : 1;
  __REG32  UNSTKERR       : 1;
  __REG32  STKERR         : 1;
  __REG32  LSPERR         : 1;
  __REG32                 : 1;
  __REG32  BFARVALID      : 1;
  __REG32  UNDEFINSTR     : 1;
  __REG32  INVSTATE       : 1;
  __REG32  INVPC          : 1;
  __REG32  NOCP           : 1;
  __REG32                 : 4;
  __REG32  UNALIGNED      : 1;
  __REG32  DIVBYZERO      : 1;
  __REG32                 : 6;
} __cfsr_bits;

/* Hard Fault Status Register */
typedef struct {
  __REG32                 : 1;
  __REG32  VECTTBL        : 1;
  __REG32                 :28;
  __REG32  FORCED         : 1;
  __REG32  DEBUGEVT       : 1;
} __hfsr_bits;

/* Debug Fault Status Register */
typedef struct {
  __REG32  HALTED         : 1;
  __REG32  BKPT           : 1;
  __REG32  DWTTRAP        : 1;
  __REG32  VCATCH         : 1;
  __REG32  EXTERNAL       : 1;
  __REG32                 :27;
} __dfsr_bits;

/* Debug Halting Control and Status Register */
typedef union {
  /* DHCSR */
  /* DHCSR_READ */
  struct {
  __REG32  C_DEBUGEN         : 1;
  __REG32  C_HALT            : 1;
  __REG32  C_STEP            : 1;
  __REG32  C_MASKINTS        : 1;
  __REG32                    : 1;
  __REG32  C_SNAPSTALL       : 1;
  __REG32                    :10;
  __REG32  S_REGRDY          : 1;
  __REG32  S_HALT            : 1;
  __REG32  S_SLEEP           : 1;
  __REG32  S_LOCKUP          : 1;
  __REG32                    : 4;
  __REG32  S_RETIRE_ST       : 1;
  __REG32  S_RESET_ST        : 1;
  __REG32                    : 6;
  };
  /* DHCSR_WRITE */
  struct {
  __REG32  C_DEBUGEN         : 1;
  __REG32  C_HALT            : 1;
  __REG32  C_STEP            : 1;
  __REG32  C_MASKINTS        : 1;
  __REG32                    : 1;
  __REG32  C_SNAPSTALL       : 1;
  __REG32                    :10;
  __REG32  DBGKEY            :16;
  } __dhcsr_write_bits;
} __dhcsr_bits;

/* Debug Core Register Selector Register */

#define DCRSR_REGSEL      ((uint32_t)0x0000007F)
#define DCRSR_REGWnR      ((uint32_t)0x00010000)

/* Debug Exception and Monitor Control Register */
typedef struct {
  __REG32  VC_CORERESET      : 1;
  __REG32                    : 3;
  __REG32  VC_MMERR          : 1;
  __REG32  VC_NOCPERR        : 1;
  __REG32  VC_CHKERR         : 1;
  __REG32  VC_STATERR        : 1;
  __REG32  VC_BUSERR         : 1;
  __REG32  VC_INTERR         : 1;
  __REG32  VC_HARDERR        : 1;
  __REG32                    : 5;
  __REG32  MON_EN            : 1;
  __REG32  MON_PEND          : 1;
  __REG32  MON_STEP          : 1;
  __REG32  MON_REQ           : 1;
  __REG32                    : 4;
  __REG32  TRCENA            : 1;
  __REG32                    : 7;
} __demcr_bits;

/* Software Trigger Interrupt Register */

#define STIR_INTID      ((uint32_t)0x000001FF)

/* Floating Point Context Control Register */
typedef struct {
  __REG32  LSPACT         : 1;
  __REG32  USER           : 1;
  __REG32                 : 1;
  __REG32  THREAD         : 1;
  __REG32  HFRDY          : 1;
  __REG32  MMRDY          : 1;
  __REG32  BFRDY          : 1;
  __REG32                 : 1;
  __REG32  MONRDY         : 1;
  __REG32                 :21;
  __REG32  LSPEN          : 1;
  __REG32  ASPEN          : 1;
} __fpccr_bits;

/* Floating Point Context Adress Register */
typedef struct {
  __REG32                  : 3;
  __REG32  ADDRESS         :29;
} __fpcar_bits;

/* Floating Point Context Adress Register */
typedef struct {
  __REG32                  :22;
  __REG32  RMode           : 2;
  __REG32  FZ              : 1;
  __REG32  DN              : 1;
  __REG32  AHP             : 1;
  __REG32                  : 5;
} __fpdscr_bits;

/* Media and FP Feature Register 0 */
typedef struct {
  __REG32  A_SIMD_registers      : 4;
  __REG32  Single_precision      : 4;
  __REG32  Double_precision      : 4;
  __REG32  FP_Exception_trapping : 4;
  __REG32  Divide                : 4;
  __REG32  Square_root           : 4;
  __REG32  Short_vectors         : 4;
  __REG32  FP_rounding_modes     : 4;
} __mvfr0_bits;

/* Media and FP Feature Register 1 */
typedef struct {
  __REG32  FtZ_mode              : 4;
  __REG32  D_NaN_mode            : 4;
  __REG32                        :16;
  __REG32  FP_HPFP               : 4;
  __REG32  FP_fused_MAC          : 4;
} __mvfr1_bits;

/* Coprocessor access control register */
typedef struct {
  __REG32  CP0            : 2;
  __REG32  CP1            : 2;
  __REG32  CP2            : 2;
  __REG32  CP3            : 2;
  __REG32  CP4            : 2;
  __REG32  CP5            : 2;
  __REG32  CP6            : 2;
  __REG32  CP7            : 2;
  __REG32                 : 4;
  __REG32  CP10           : 2;
  __REG32  CP11           : 2;
  __REG32                 : 8;
} __cpacr_bits;

/* Level configuration register */
typedef struct {
  __REG32  WAKEUP0_L      : 1;
  __REG32  WAKEUP1_L      : 1;
  __REG32  WAKEUP2_L      : 1;
  __REG32  WAKEUP3_L      : 1;
  __REG32  ATIMER_L       : 1;
  __REG32  RTC_L          : 1;
  __REG32  BOD_L          : 1;
  __REG32  WWDT_L         : 1;
  __REG32  			          : 3;
  __REG32  SDMMC_L        : 1;
  __REG32  CAN_L          : 1;
  __REG32  TIM2_L         : 1;
  __REG32  TIM6_L         : 1;
  __REG32                 : 1;
  __REG32  TIM14_L        : 1;
  __REG32                 : 2;
  __REG32  RESET_L        : 1;
  __REG32                 :12;
} __er_hilo_bits;

/* Edge configuration register */
typedef struct {
  __REG32  WAKEUP0_E      : 1;
  __REG32  WAKEUP1_E      : 1;
  __REG32  WAKEUP2_E      : 1;
  __REG32  WAKEUP3_E      : 1;
  __REG32  ATIMER_E       : 1;
  __REG32  RTC_E          : 1;
  __REG32  BOD_E          : 1;
  __REG32  WWDT_E         : 1;
  __REG32  			          : 3;
  __REG32  SDMMC_E        : 1;
  __REG32  CAN_E          : 1;
  __REG32  TIM2_E         : 1;
  __REG32  TIM6_E         : 1;
  __REG32                 : 1;
  __REG32  TIM14_E        : 1;
  __REG32                 : 2;
  __REG32  RESET_E        : 1;
  __REG32                 :12;
} __er_edge_bits;

/* Interrupt clear enable register */

#define ER_CLR_EN_WAKEUP0_CLREN     (0x00000001UL)
#define ER_CLR_EN_WAKEUP1_CLREN     (0x00000002UL)
#define ER_CLR_EN_WAKEUP2_CLREN     (0x00000004UL)
#define ER_CLR_EN_WAKEUP3_CLREN     (0x00000008UL)
#define ER_CLR_EN_ATIMER_CLREN      (0x00000010UL)
#define ER_CLR_EN_RTC_CLREN         (0x00000020UL)
#define ER_CLR_EN_BOD_CLREN         (0x00000040UL)
#define ER_CLR_EN_WWDT_CLREN        (0x00000080UL)
#define ER_CLR_EN_SDMMC_CLREN       (0x00000800UL)
#define ER_CLR_EN_CAN_CLREN         (0x00001000UL)
#define ER_CLR_EN_TIM2_CLREN        (0x00002000UL)
#define ER_CLR_EN_TIM6_CLREN        (0x00004000UL)
#define ER_CLR_EN_TIM14_CLREN       (0x00010000UL)
#define ER_CLR_EN_RESET_CLREN       (0x00080000UL)

