una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
/* CREG6 control register */
typedef struct {
  __REG32  ETHMODE             : 3;
  __REG32                      : 1;
  __REG32  CTOUTCTRL           : 1;
  __REG32                      : 7;
  __REG32  I2S0_TX_SCK_IN_SEL  : 1;
  __REG32  I2S0_RX_SCK_IN_SEL  : 1;
  __REG32  I2S1_TX_SCK_IN_SEL  : 1;
  __REG32  I2S1_RX_SCK_IN_SEL  : 1;
  __REG32  EMC_CLK_SEL         : 1;
  __REG32                      :15;
} __creg_creg6_bits;

/* Cortex-M4 TXEV event clear register */
typedef struct {
  __REG32  TXEVCLR        : 1;
  __REG32                 :31;
} __creg_m4txevent_bits;

/* Cortex-M0 TXEV event clear register */
typedef struct {
  __REG32  TXEVCLR        : 1;
  __REG32                 :31;
} __creg_m0txevent_bits;

/* ARM Cortex-M0 memory mapping register */
typedef struct {
  __REG32                 :12;
  __REG32  M0APPMAP       :20;
} __creg_m0appmemmap_bits;


/* Hardware sleep event enable register */
typedef struct {
  __REG32  ENA_EVENT0     : 1;
  __REG32                 :31;
} __pmc_pd0_sleep0_hw_ena_bits;

/* Sleep power mode register */
typedef struct {
  __REG32  PWR_STATE      :32;
} __pmc_pd0_sleep0_mode_bits;


/* FREQ_MON register */
typedef struct {
  __REG32  RCNT           : 9;
  __REG32  FCNT           :14;
  __REG32  MEAS           : 1;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_freq_mon_bits;

/* XTAL_OSC_CTRL register */
typedef struct {
  __REG32  ENABLE         : 1;
  __REG32  BYPASS         : 1;
  __REG32  HF             : 1;
  __REG32                 :29;
} __cgu_xtal_osc_ctrl_bits;

/* PLL0AUDIO_STAT register */
typedef struct {
  __REG32  LOCK           : 1;
  __REG32  FR             : 1;
  __REG32                 :30;
} __cgu_pll0audio_stat_bits;

/* PLL0AUDIO control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32  BYPASS         : 1;
  __REG32  DIRECTI        : 1;
  __REG32  DIRECTO        : 1;
  __REG32  CLKEN          : 1;
  __REG32                 : 1;
  __REG32  FRM            : 1;
  __REG32                 : 4;
  __REG32  AUTOBLOCK      : 1;
  __REG32  PLLFRAQ_REQ    : 1;
  __REG32  SEL_EXT        : 1;
  __REG32  MOD_PD         : 1;
  __REG32                 : 9;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_pll0audio_ctrl_bits;

/* PLL0AUDIO_MDIV register */
typedef struct {
  __REG32  MDEC           :17;
  __REG32                 :15;
} __cgu_pll0audio_mdiv_bits;

/* PLL0AUDIO NP-divider register */
typedef struct {
  __REG32  PDEC           : 7;
  __REG32                 : 5;
  __REG32  NDEC           :10;
  __REG32                 :10;
} __cgu_pll0audio_np_div_bits;

/* PLL0AUDIO fractional divider register */
typedef struct {
  __REG32  PLLFRACT_CTRL  :22;
  __REG32                 :10;
} __cgu_pll0audio_frac_bits;

/* PLL1_STAT register */
typedef struct {
  __REG32  LOCK           : 1;
  __REG32                 :31;
} __cgu_pll1_stat_bits;

/* PLL1_CTRL register */
typedef struct {
  __REG32  PD             : 1;
  __REG32  BYPASS         : 1;
  __REG32                 : 4;
  __REG32  FBSEL          : 1;
  __REG32  DIRECT         : 1;
  __REG32  PSEL           : 2;
  __REG32                 : 1;
  __REG32  AUTOBLOCK      : 1;
  __REG32  NSEL           : 2;
  __REG32                 : 2;
  __REG32  MSEL           : 8;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_pll1_ctrl_bits;

/* IDIVA control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 : 1;
  __REG32  IDIV           : 2;
  __REG32                 : 7;
  __REG32  AUTOBLOCK      : 1;
  __REG32                 :12;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_idiva_ctrl_bits;

/* IDIVB/C/D control registers */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 : 1;
  __REG32  IDIV           : 4;
  __REG32                 : 5;
  __REG32  AUTOBLOCK      : 1;
  __REG32                 :12;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_idivx_ctrl_bits;

/* IDIVE control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 : 1;
  __REG32  IDIV           : 8;
  __REG32                 : 1;
  __REG32  AUTOBLOCK      : 1;
  __REG32                 :12;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_idive_ctrl_bits;

/* BASE_SAFE_CLK control register */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 :10;
  __REG32  AUTOBLOCK      : 1;
  __REG32                 :12;
  __REG32  CLK_SEL        : 5;
  __REG32                 : 3;
} __cgu_base_xxx_clk_bits;


/* CCU1/2 power mode register */
typedef struct {
  __REG32  PD             : 1;
  __REG32                 :31;
} __ccu_pm_bits;

/* CCU1 base clock status register */
typedef struct {
  __REG32  BASE_APB3_CLK_IND   : 1;
  __REG32  BASE_APB1_CLK_IND   : 1;
  __REG32  BASE_SPIFI_CLK_IND  : 1;
  __REG32  BASE_M4_CLK_IND     : 1;
  __REG32                      : 2;
  __REG32  BASE_PERIPH_CLK_IND : 1;
  __REG32  									   : 2;
  __REG32  BASE_SPI_CLK_IND    : 1;
  __REG32                      :22;
} __ccu1_base_stat_bits;

/* CCU2 base clock status register */
typedef struct {
  __REG32                     : 1;
  __REG32  BASE_UART3_CLK     : 1;
  __REG32  BASE_UART2_CLK     : 1;
  __REG32  BASE_UART1_CLK     : 1;
  __REG32  BASE_UART0_CLK     : 1;
  __REG32  BASE_SSP1_CLK      : 1;
  __REG32  BASE_SSP0_CLK      : 1;
  __REG32                     :25;
} __ccu2_base_stat_bits;

/* CCU1/2 branch clock configuration register */
/* CCU1/2 branch clock status register */
typedef struct {
  __REG32  RUN                : 1;
  __REG32  AUTO               : 1;
  __REG32  WAKEUP             : 1;
  __REG32                     :29;
} __ccu_clk_cfg_bits;

/* CCU1 CLK_EMCDIV_CFG branch clock configuration register */
typedef struct {
  __REG32  RUN                : 1;
  __REG32  AUTO               : 1;
  __REG32  WAKEUP             : 1;
  __REG32                     : 2;
  __REG32  DIV                : 3;
  __REG32                     :24;
} __ccu1_clk_emcdiv_cfg_bits;


/* Reset control register 0 */

