una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
/* Reload registers */
typedef struct {
  __REG32  PRESET                :12;
  __REG32                        :20;
} __sgpio_presetx_bits;

/* Down counter registers */
typedef struct {
  __REG32  COUNT                 :12;
  __REG32                        :20;
} __sgpio_countx_bits;

/* Position registers */
typedef struct {
  __REG32  POS                   : 8;
  __REG32  POS_RESET             : 8;
  __REG32                        :16;
} __sgpio_posx_bits;

/* GPIO input status register */
typedef struct {
  __REG32  GPIO_IN0              : 1;
  __REG32  GPIO_IN1              : 1;
  __REG32  GPIO_IN2              : 1;
  __REG32  GPIO_IN3              : 1;
  __REG32  GPIO_IN4              : 1;
  __REG32  GPIO_IN5              : 1;
  __REG32  GPIO_IN6              : 1;
  __REG32  GPIO_IN7              : 1;
  __REG32  GPIO_IN8              : 1;
  __REG32  GPIO_IN9              : 1;
  __REG32  GPIO_IN10             : 1;
  __REG32  GPIO_IN11             : 1;
  __REG32  GPIO_IN12             : 1;
  __REG32  GPIO_IN13             : 1;
  __REG32  GPIO_IN14             : 1;
  __REG32  GPIO_IN15             : 1;
  __REG32                        :16;
} __sgpio_gpio_inreg_bits;

/* GPIO output control register */
typedef struct {
  __REG32  GPIO_OUT0             : 1;
  __REG32  GPIO_OUT1             : 1;
  __REG32  GPIO_OUT2             : 1;
  __REG32  GPIO_OUT3             : 1;
  __REG32  GPIO_OUT4             : 1;
  __REG32  GPIO_OUT5             : 1;
  __REG32  GPIO_OUT6             : 1;
  __REG32  GPIO_OUT7             : 1;
  __REG32  GPIO_OUT8             : 1;
  __REG32  GPIO_OUT9             : 1;
  __REG32  GPIO_OUT10            : 1;
  __REG32  GPIO_OUT11            : 1;
  __REG32  GPIO_OUT12            : 1;
  __REG32  GPIO_OUT13            : 1;
  __REG32  GPIO_OUT14            : 1;
  __REG32  GPIO_OUT15            : 1;
  __REG32                        :16;
} __sgpio_gpio_outreg_bits;

/* GPIO output enable register */
typedef struct {
  __REG32  GPIO_OE0             : 1;
  __REG32  GPIO_OE1             : 1;
  __REG32  GPIO_OE2             : 1;
  __REG32  GPIO_OE3             : 1;
  __REG32  GPIO_OE4             : 1;
  __REG32  GPIO_OE5             : 1;
  __REG32  GPIO_OE6             : 1;
  __REG32  GPIO_OE7             : 1;
  __REG32  GPIO_OE8             : 1;
  __REG32  GPIO_OE9             : 1;
  __REG32  GPIO_OE10            : 1;
  __REG32  GPIO_OE11            : 1;
  __REG32  GPIO_OE12            : 1;
  __REG32  GPIO_OE13            : 1;
  __REG32  GPIO_OE14            : 1;
  __REG32  GPIO_OE15            : 1;
  __REG32                        :16;
} __sgpio_gpio_oenreg_bits;

/* Slice count enable register */
typedef struct {
  __REG32  CTRL_ENABLED0         : 1;
  __REG32  CTRL_ENABLED1         : 1;
  __REG32  CTRL_ENABLED2         : 1;
  __REG32  CTRL_ENABLED3         : 1;
  __REG32  CTRL_ENABLED4         : 1;
  __REG32  CTRL_ENABLED5         : 1;
  __REG32  CTRL_ENABLED6         : 1;
  __REG32  CTRL_ENABLED7         : 1;
  __REG32  CTRL_ENABLED8         : 1;
  __REG32  CTRL_ENABLED9         : 1;
  __REG32  CTRL_ENABLED10        : 1;
  __REG32  CTRL_ENABLED11        : 1;
  __REG32  CTRL_ENABLED12        : 1;
  __REG32  CTRL_ENABLED13        : 1;
  __REG32  CTRL_ENABLED14        : 1;
  __REG32  CTRL_ENABLED15        : 1;
  __REG32                        :16;
} __sgpio_ctrl_enabled_bits;

/* Slice count disable register */
typedef struct {
  __REG32  CTRL_DISABLED0        : 1;
  __REG32  CTRL_DISABLED1        : 1;
  __REG32  CTRL_DISABLED2        : 1;
  __REG32  CTRL_DISABLED3        : 1;
  __REG32  CTRL_DISABLED4        : 1;
  __REG32  CTRL_DISABLED5        : 1;
  __REG32  CTRL_DISABLED6        : 1;
  __REG32  CTRL_DISABLED7        : 1;
  __REG32  CTRL_DISABLED8        : 1;
  __REG32  CTRL_DISABLED9        : 1;
  __REG32  CTRL_DISABLED10       : 1;
  __REG32  CTRL_DISABLED11       : 1;
  __REG32  CTRL_DISABLED12       : 1;
  __REG32  CTRL_DISABLED13       : 1;
  __REG32  CTRL_DISABLED14       : 1;
  __REG32  CTRL_DISABLED15       : 1;
  __REG32                        :16;
} __sgpio_ctrl_disabled_bits;

/* Shift clock interrupt clear mask register */

#define SGPIO_CLR_EN_0_CLR_SCI    (0x0000FFFFUL)
#define SGPIO_CLR_EN_0_CLR_SCI0   (0x00000001UL)
#define SGPIO_CLR_EN_0_CLR_SCI1   (0x00000002UL)
#define SGPIO_CLR_EN_0_CLR_SCI2   (0x00000004UL)
#define SGPIO_CLR_EN_0_CLR_SCI3   (0x00000008UL)
#define SGPIO_CLR_EN_0_CLR_SCI4   (0x00000010UL)
#define SGPIO_CLR_EN_0_CLR_SCI5   (0x00000020UL)
#define SGPIO_CLR_EN_0_CLR_SCI6   (0x00000040UL)
#define SGPIO_CLR_EN_0_CLR_SCI7   (0x00000080UL)
#define SGPIO_CLR_EN_0_CLR_SCI8   (0x00000100UL)
#define SGPIO_CLR_EN_0_CLR_SCI9   (0x00000200UL)
#define SGPIO_CLR_EN_0_CLR_SCI10  (0x00000400UL)
#define SGPIO_CLR_EN_0_CLR_SCI11  (0x00000800UL)
#define SGPIO_CLR_EN_0_CLR_SCI12  (0x00001000UL)
#define SGPIO_CLR_EN_0_CLR_SCI13  (0x00002000UL)
#define SGPIO_CLR_EN_0_CLR_SCI14  (0x00004000UL)
#define SGPIO_CLR_EN_0_CLR_SCI15  (0x00008000UL)

/* Shift clock interrupt set mask register */
#define SGPIO_SET_EN_0_SET_SCI    (0x0000FFFFUL)
#define SGPIO_SET_EN_0_SET_SCI0   (0x00000001UL)
#define SGPIO_SET_EN_0_SET_SCI1   (0x00000002UL)
#define SGPIO_SET_EN_0_SET_SCI2   (0x00000004UL)
#define SGPIO_SET_EN_0_SET_SCI3   (0x00000008UL)
#define SGPIO_SET_EN_0_SET_SCI4   (0x00000010UL)
#define SGPIO_SET_EN_0_SET_SCI5   (0x00000020UL)
#define SGPIO_SET_EN_0_SET_SCI6   (0x00000040UL)
#define SGPIO_SET_EN_0_SET_SCI7   (0x00000080UL)
#define SGPIO_SET_EN_0_SET_SCI8   (0x00000100UL)
#define SGPIO_SET_EN_0_SET_SCI9   (0x00000200UL)
#define SGPIO_SET_EN_0_SET_SCI10  (0x00000400UL)
#define SGPIO_SET_EN_0_SET_SCI11  (0x00000800UL)
#define SGPIO_SET_EN_0_SET_SCI12  (0x00001000UL)
#define SGPIO_SET_EN_0_SET_SCI13  (0x00002000UL)
#define SGPIO_SET_EN_0_SET_SCI14  (0x00004000UL)
#define SGPIO_SET_EN_0_SET_SCI15  (0x00008000UL)

