una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI    (0x0000FFFFUL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI0   (0x00000001UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI1   (0x00000002UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI2   (0x00000004UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI3   (0x00000008UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI4   (0x00000010UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI5   (0x00000020UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI6   (0x00000040UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI7   (0x00000080UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI8   (0x00000100UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI9   (0x00000200UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI10  (0x00000400UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI11  (0x00000800UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI12  (0x00001000UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI13  (0x00002000UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI14  (0x00004000UL)
#define SGPIO_CTR_STATUS_1_CTR_STATUS_CCI15  (0x00008000UL)

/* Capture clock interrupt set status register */

#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI    (0x0000FFFFUL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI0   (0x00000001UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI1   (0x00000002UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI2   (0x00000004UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI3   (0x00000008UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI4   (0x00000010UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI5   (0x00000020UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI6   (0x00000040UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI7   (0x00000080UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI8   (0x00000100UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI9   (0x00000200UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI10  (0x00000400UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI11  (0x00000800UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI12  (0x00001000UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI13  (0x00002000UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI14  (0x00004000UL)
#define SGPIO_SET_STATUS_1_CTR_STATUS_CCI15  (0x00008000UL)

/* Pattern match interrupt clear mask register */

#define SGPIO_CLR_EN_2_CLR_EN2_PMI    (0x0000FFFFUL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI0   (0x00000001UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI1   (0x00000002UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI2   (0x00000004UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI3   (0x00000008UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI4   (0x00000010UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI5   (0x00000020UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI6   (0x00000040UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI7   (0x00000080UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI8   (0x00000100UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI9   (0x00000200UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI10  (0x00000400UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI11  (0x00000800UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI12  (0x00001000UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI13  (0x00002000UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI14  (0x00004000UL)
#define SGPIO_CLR_EN_2_CLR_EN2_PMI15  (0x00008000UL)

/* Pattern match interrupt set mask register */

#define SGPIO_SET_EN_2_SET_EN_PMI    (0x0000FFFFUL)
#define SGPIO_SET_EN_2_SET_EN_PMI0   (0x00000001UL)
#define SGPIO_SET_EN_2_SET_EN_PMI1   (0x00000002UL)
#define SGPIO_SET_EN_2_SET_EN_PMI2   (0x00000004UL)
#define SGPIO_SET_EN_2_SET_EN_PMI3   (0x00000008UL)
#define SGPIO_SET_EN_2_SET_EN_PMI4   (0x00000010UL)
#define SGPIO_SET_EN_2_SET_EN_PMI5   (0x00000020UL)
#define SGPIO_SET_EN_2_SET_EN_PMI6   (0x00000040UL)
#define SGPIO_SET_EN_2_SET_EN_PMI7   (0x00000080UL)
#define SGPIO_SET_EN_2_SET_EN_PMI8   (0x00000100UL)
#define SGPIO_SET_EN_2_SET_EN_PMI9   (0x00000200UL)
#define SGPIO_SET_EN_2_SET_EN_PMI10  (0x00000400UL)
#define SGPIO_SET_EN_2_SET_EN_PMI11  (0x00000800UL)
#define SGPIO_SET_EN_2_SET_EN_PMI12  (0x00001000UL)
#define SGPIO_SET_EN_2_SET_EN_PMI13  (0x00002000UL)
#define SGPIO_SET_EN_2_SET_EN_PMI14  (0x00004000UL)
#define SGPIO_SET_EN_2_SET_EN_PMI15  (0x00008000UL)

/* Pattern match interrupt enable register */
typedef struct {
  __REG32  ENABLE_PMI0          : 1;
  __REG32  ENABLE_PMI1          : 1;
  __REG32  ENABLE_PMI2          : 1;
  __REG32  ENABLE_PMI3          : 1;
  __REG32  ENABLE_PMI4          : 1;
  __REG32  ENABLE_PMI5          : 1;
  __REG32  ENABLE_PMI6          : 1;
  __REG32  ENABLE_PMI7          : 1;
  __REG32  ENABLE_PMI8          : 1;
  __REG32  ENABLE_PMI9          : 1;
  __REG32  ENABLE_PMI10         : 1;
  __REG32  ENABLE_PMI11         : 1;
  __REG32  ENABLE_PMI12         : 1;
  __REG32  ENABLE_PMI13         : 1;
  __REG32  ENABLE_PMI14         : 1;
  __REG32  ENABLE_PMI15         : 1;
  __REG32                       :16;
} __sgpio_enable_2_bits;

/* Pattern match interrupt status register */
typedef struct {
  __REG32  STATUS_PMI0          : 1;
  __REG32  STATUS_PMI1          : 1;
  __REG32  STATUS_PMI2          : 1;
  __REG32  STATUS_PMI3          : 1;
  __REG32  STATUS_PMI4          : 1;
  __REG32  STATUS_PMI5          : 1;
  __REG32  STATUS_PMI6          : 1;
  __REG32  STATUS_PMI7          : 1;
  __REG32  STATUS_PMI8          : 1;
  __REG32  STATUS_PMI9          : 1;
  __REG32  STATUS_PMI10         : 1;
  __REG32  STATUS_PMI11         : 1;
  __REG32  STATUS_PMI12         : 1;
  __REG32  STATUS_PMI13         : 1;
  __REG32  STATUS_PMI14         : 1;
  __REG32  STATUS_PMI15         : 1;
  __REG32                       :16;
} __sgpio_status_2_bits;

/* Pattern match interrupt clear status register */

#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI    (0x0000FFFFUL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI0   (0x00000001UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI1   (0x00000002UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI2   (0x00000004UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI3   (0x00000008UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI4   (0x00000010UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI5   (0x00000020UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI6   (0x00000040UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI7   (0x00000080UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI8   (0x00000100UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI9   (0x00000200UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI10  (0x00000400UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI11  (0x00000800UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI12  (0x00001000UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI13  (0x00002000UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI14  (0x00004000UL)
#define SGPIO_CTR_STATUS_2_CTR_STATUS_PMI15  (0x00008000UL)

