una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
/* Pattern match interrupt set status register */

#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI    (0x0000FFFFUL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI0   (0x00000001UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI1   (0x00000002UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI2   (0x00000004UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI3   (0x00000008UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI4   (0x00000010UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI5   (0x00000020UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI6   (0x00000040UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI7   (0x00000080UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI8   (0x00000100UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI9   (0x00000200UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI10  (0x00000400UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI11  (0x00000800UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI12  (0x00001000UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI13  (0x00002000UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI14  (0x00004000UL)
#define SGPIO_SET_STATUS_2_CTR_STATUS_PMI15  (0x00008000UL)

/* Input interrupt clear mask register */

#define SGPIO_CLR_EN_3_CLR_EN_INPI    (0x0000FFFFUL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI0   (0x00000001UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI1   (0x00000002UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI2   (0x00000004UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI3   (0x00000008UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI4   (0x00000010UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI5   (0x00000020UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI6   (0x00000040UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI7   (0x00000080UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI8   (0x00000100UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI9   (0x00000200UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI10  (0x00000400UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI11  (0x00000800UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI12  (0x00001000UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI13  (0x00002000UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI14  (0x00004000UL)
#define SGPIO_CLR_EN_3_CLR_EN_INPI15  (0x00008000UL)

/* Input interrupt set mask register */

#define SGPIO_SET_EN_3_SET_EN_INPI    (0x0000FFFFUL)
#define SGPIO_SET_EN_3_SET_EN_INPI0   (0x00000001UL)
#define SGPIO_SET_EN_3_SET_EN_INPI1   (0x00000002UL)
#define SGPIO_SET_EN_3_SET_EN_INPI2   (0x00000004UL)
#define SGPIO_SET_EN_3_SET_EN_INPI3   (0x00000008UL)
#define SGPIO_SET_EN_3_SET_EN_INPI4   (0x00000010UL)
#define SGPIO_SET_EN_3_SET_EN_INPI5   (0x00000020UL)
#define SGPIO_SET_EN_3_SET_EN_INPI6   (0x00000040UL)
#define SGPIO_SET_EN_3_SET_EN_INPI7   (0x00000080UL)
#define SGPIO_SET_EN_3_SET_EN_INPI8   (0x00000100UL)
#define SGPIO_SET_EN_3_SET_EN_INPI9   (0x00000200UL)
#define SGPIO_SET_EN_3_SET_EN_INPI10  (0x00000400UL)
#define SGPIO_SET_EN_3_SET_EN_INPI11  (0x00000800UL)
#define SGPIO_SET_EN_3_SET_EN_INPI12  (0x00001000UL)
#define SGPIO_SET_EN_3_SET_EN_INPI13  (0x00002000UL)
#define SGPIO_SET_EN_3_SET_EN_INPI14  (0x00004000UL)
#define SGPIO_SET_EN_3_SET_EN_INPI15  (0x00008000UL)

/* Input interrupt enable register */
typedef struct {
  __REG32  ENABLE3_INPI0          : 1;
  __REG32  ENABLE3_INPI1          : 1;
  __REG32  ENABLE3_INPI2          : 1;
  __REG32  ENABLE3_INPI3          : 1;
  __REG32  ENABLE3_INPI4          : 1;
  __REG32  ENABLE3_INPI5          : 1;
  __REG32  ENABLE3_INPI6          : 1;
  __REG32  ENABLE3_INPI7          : 1;
  __REG32  ENABLE3_INPI8          : 1;
  __REG32  ENABLE3_INPI9          : 1;
  __REG32  ENABLE3_INPI10         : 1;
  __REG32  ENABLE3_INPI11         : 1;
  __REG32  ENABLE3_INPI12         : 1;
  __REG32  ENABLE3_INPI13         : 1;
  __REG32  ENABLE3_INPI14         : 1;
  __REG32  ENABLE3_INPI15         : 1;
  __REG32                         :16;
} __sgpio_enable_3_bits;

/* Input interrupt status register */
typedef struct {
  __REG32  STATUS_INPI0          : 1;
  __REG32  STATUS_INPI1          : 1;
  __REG32  STATUS_INPI2          : 1;
  __REG32  STATUS_INPI3          : 1;
  __REG32  STATUS_INPI4          : 1;
  __REG32  STATUS_INPI5          : 1;
  __REG32  STATUS_INPI6          : 1;
  __REG32  STATUS_INPI7          : 1;
  __REG32  STATUS_INPI8          : 1;
  __REG32  STATUS_INPI9          : 1;
  __REG32  STATUS_INPI10         : 1;
  __REG32  STATUS_INPI11         : 1;
  __REG32  STATUS_INPI12         : 1;
  __REG32  STATUS_INPI13         : 1;
  __REG32  STATUS_INPI14         : 1;
  __REG32  STATUS_INPI15         : 1;
  __REG32                        :16;
} __sgpio_status_3_bits;

/* Input interrupt clear status register */

#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI    (0x0000FFFFUL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI0   (0x00000001UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI1   (0x00000002UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI2   (0x00000004UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI3   (0x00000008UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI4   (0x00000010UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI5   (0x00000020UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI6   (0x00000040UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI7   (0x00000080UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI8   (0x00000100UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI9   (0x00000200UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI10  (0x00000400UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI11  (0x00000800UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI12  (0x00001000UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI13  (0x00002000UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI14  (0x00004000UL)
#define SGPIO_CTR_STATUS_3_CTR_STATUS_INPI15  (0x00008000UL)

/* Input interrupt set status register */

#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI    (0x0000FFFFUL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI0   (0x00000001UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI1   (0x00000002UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI2   (0x00000004UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI3   (0x00000008UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI4   (0x00000010UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI5   (0x00000020UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI6   (0x00000040UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI7   (0x00000080UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI8   (0x00000100UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI9   (0x00000200UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI10  (0x00000400UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI11  (0x00000800UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI12  (0x00001000UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI13  (0x00002000UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI14  (0x00004000UL)
#define SGPIO_SET_STATUS_3_CTR_STATUS_INPI15  (0x00008000UL)

/* DMA Interrupt Status Register */
typedef struct{
__REG32 INTSTAT0  : 1;
__REG32 INTSTAT1  : 1;
__REG32 INTSTAT2  : 1;
__REG32 INTSTAT3  : 1;
__REG32 INTSTAT4  : 1;
__REG32 INTSTAT5  : 1;
__REG32 INTSTAT6  : 1;
__REG32 INTSTAT7  : 1;
__REG32             :24;
} __dmacintstatus_bits;

