una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
__IO_REG32(    SGPIO_MASK_A,          0x40101200,__READ_WRITE);
__IO_REG32(    SGPIO_MASK_H,          0x40101204,__READ_WRITE);
__IO_REG32(    SGPIO_MASK_I,          0x40101208,__READ_WRITE);
__IO_REG32(    SGPIO_MASK_P,          0x4010120C,__READ_WRITE);
__IO_REG32_BIT(SGPIO_GPIO_INREG,      0x40101210,__READ      ,__sgpio_gpio_inreg_bits);
__IO_REG32_BIT(SGPIO_GPIO_OUTREG,     0x40101214,__READ_WRITE,__sgpio_gpio_outreg_bits);
__IO_REG32_BIT(SGPIO_GPIO_OENREG,     0x40101218,__READ_WRITE,__sgpio_gpio_oenreg_bits);
__IO_REG32_BIT(SGPIO_CTRL_ENABLED,    0x4010121C,__READ_WRITE,__sgpio_ctrl_enabled_bits);
__IO_REG32_BIT(SGPIO_CTRL_DISABLED,   0x40101220,__READ_WRITE,__sgpio_ctrl_disabled_bits);

__IO_REG32(    SGPIO_CLR_EN_0,        0x40101F00,__WRITE     );
__IO_REG32(    SGPIO_SET_EN_0,        0x40101F04,__WRITE     );
__IO_REG32_BIT(SGPIO_ENABLE_0,        0x40101F08,__READ      ,__sgpio_enable_0_bits);
__IO_REG32_BIT(SGPIO_STATUS_0,        0x40101F0C,__READ      ,__sgpio_status_0_bits);
__IO_REG32(    SGPIO_CTR_STATUS_0,    0x40101F10,__WRITE     );
__IO_REG32(    SGPIO_SET_STATUS_0,    0x40101F14,__WRITE     );

__IO_REG32(    SGPIO_CLR_EN_1,        0x40101F20,__WRITE     );
__IO_REG32(    SGPIO_SET_EN_1,        0x40101F24,__WRITE     );
__IO_REG32_BIT(SGPIO_ENABLE_1,        0x40101F28,__READ      ,__sgpio_enable_1_bits);
__IO_REG32_BIT(SGPIO_STATUS_1,        0x40101F2C,__READ      ,__sgpio_status_1_bits);
__IO_REG32(    SGPIO_CTR_STATUS_1,    0x40101F30,__WRITE     );
__IO_REG32(    SGPIO_SET_STATUS_1,    0x40101F34,__WRITE     );

__IO_REG32(    SGPIO_CLR_EN_2,        0x40101F40,__WRITE     );
__IO_REG32(    SGPIO_SET_EN_2,        0x40101F44,__WRITE     );
__IO_REG32_BIT(SGPIO_ENABLE_2,        0x40101F48,__READ      ,__sgpio_enable_2_bits);
__IO_REG32_BIT(SGPIO_STATUS_2,        0x40101F4C,__READ      ,__sgpio_status_2_bits);
__IO_REG32(    SGPIO_CTR_STATUS_2,    0x40101F50,__WRITE     );
__IO_REG32(    SGPIO_SET_STATUS_2,    0x40101F54,__WRITE     );

__IO_REG32(    SGPIO_CLR_EN_3,        0x40101F60,__WRITE     );
__IO_REG32(    SGPIO_SET_EN_3,        0x40101F64,__WRITE     );
__IO_REG32_BIT(SGPIO_ENABLE_3,        0x40101F68,__READ      ,__sgpio_enable_3_bits);
__IO_REG32_BIT(SGPIO_STATUS_3,        0x40101F6C,__READ      ,__sgpio_status_3_bits);
__IO_REG32(    SGPIO_CTR_STATUS_3,    0x40101F70,__WRITE     );
__IO_REG32(    SGPIO_SET_STATUS_3,    0x40101F74,__WRITE     );



/***************************************************************************
 **
 ** GPDMA
 **
 ***************************************************************************/
__IO_REG32_BIT(DMACINTSTATUS,         0x40002000,__READ      ,__dmacintstatus_bits);
#define GPDMA_INTSTAT      DMACINTSTATUS
#define GPDMA_INTSTAT_bit  DMACINTSTATUS_bit

__IO_REG32_BIT(DMACINTTCSTATUS,       0x40002004,__READ      ,__dmacinttcstatus_bits);
#define GPDMA_INTTCSTAT      DMACINTTCSTATUS
#define GPDMA_INTTCSTAT_bit  DMACINTTCSTATUS_bit

__IO_REG32(   DMACINTTCCLEAR,        0x40002008,__WRITE     );
#define GPDMA_INTTCCLEAR     DMACINTTCCLEAR

__IO_REG32_BIT(DMACINTERRSTAT,        0x4000200C,__READ      ,__dmacinterrstat_bits);
#define GPDMA_INTERRSTAT      DMACINTERRSTAT
#define GPDMA_INTERRSTAT_bit  DMACINTERRSTAT_bit

__IO_REG32(    DMACINTERRCLR,         0x40002010,__WRITE     );
#define GPDMA_INTERRCLR      DMACINTERRCLR

__IO_REG32_BIT(DMACRAWINTTCSTATUS,    0x40002014,__READ      ,__dmacrawinttcstatus_bits);
#define GPDMA_RAWINTTCSTAT       DMACRAWINTTCSTATUS
#define GPDMA_RAWINTTCSTAT_bit   DMACRAWINTTCSTATUS_bit

__IO_REG32_BIT(DMACRAWINTERRORSTATUS, 0x40002018,__READ      ,__dmacrawinterrorstatus_bits);
#define GPDMA_RAWINTERRSTAT      DMACRAWINTERRORSTATUS
#define GPDMA_RAWINTERRSTAT_bit  DMACRAWINTERRORSTATUS_bit

__IO_REG32_BIT(DMACENBLDCHNS,         0x4000201C,__READ      ,__dmacenbldchns_bits);
#define GPDMA_ENBLDCHNS      DMACENBLDCHNS
#define GPDMA_ENBLDCHNS_bit  DMACENBLDCHNS_bit

__IO_REG32_BIT(DMACSOFTBREQ,          0x40002020,__READ_WRITE,__dmacsoftbreq_bits);
#define GPDMA_SOFTBREQ      DMACSOFTBREQ
#define GPDMA_SOFTBREQ_bit  DMACSOFTBREQ_bit

__IO_REG32_BIT(DMACSOFTSREQ,          0x40002024,__READ_WRITE,__dmacsoftsreq_bits);
#define GPDMA_SOFTSREQ      DMACSOFTSREQ
#define GPDMA_SOFTSREQ_bit  DMACSOFTSREQ_bit

__IO_REG32_BIT(DMACSOFTLBREQ,         0x40002028,__READ_WRITE,__dmacsoftlbreq_bits);
#define GPDMA_SOFTLBREQ      DMACSOFTLBREQ
#define GPDMA_SOFTLBREQ_bit  DMACSOFTLBREQ_bit

__IO_REG32_BIT(DMACSOFTLSREQ,         0x4000202C,__READ_WRITE,__dmacsoftlsreq_bits);
#define GPDMA_SOFTLSREQ      DMACSOFTLSREQ
#define GPDMA_SOFTLSREQ_bit  DMACSOFTLSREQ_bit

__IO_REG32_BIT(DMACCONFIGURATION,     0x40002030,__READ_WRITE,__dmacconfig_bits);
#define GPDMA_CONFIG      DMACCONFIGURATION
#define GPDMA_CONFIG_bit  DMACCONFIGURATION_bit

__IO_REG32_BIT(DMACSYNC,              0x40002034,__READ_WRITE,__dmacsync_bits);
#define GPDMA_SYNC      DMACSYNC
#define GPDMA_SYNC_bit  DMACSYNC_bit

__IO_REG32(    DMACC0SRCADDR,         0x40002100,__READ_WRITE);
#define GPDMA_C0SRCADDR      DMACC0SRCADDR

__IO_REG32(    DMACC0DESTADDR,        0x40002104,__READ_WRITE);
#define GPDMA_C0DESTADDR      DMACC0DESTADDR

__IO_REG32_BIT(DMACC0LLI,             0x40002108,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C0LLI      DMACC0LLI
#define GPDMA_C0LLI_bit  DMACC0LLI_bit

__IO_REG32_BIT(DMACC0CONTROL,         0x4000210C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C0CONTROL      DMACC0CONTROL
#define GPDMA_C0CONTROL_bit  DMACC0CONTROL_bit

__IO_REG32_BIT(DMACC0CONFIGURATION,   0x40002110,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C0CONFIG      DMACC0CONFIGURATION
#define GPDMA_C0CONFIG_bit  DMACC0CONFIGURATION_bit

__IO_REG32(    DMACC1SRCADDR,         0x40002120,__READ_WRITE);
#define GPDMA_C1SRCADDR      DMACC1SRCADDR

__IO_REG32(    DMACC1DESTADDR,        0x40002124,__READ_WRITE);
#define GPDMA_C1DESTADDR      DMACC1DESTADDR

__IO_REG32_BIT(DMACC1LLI,             0x40002128,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C1LLI      DMACC1LLI
#define GPDMA_C1LLI_bit  DMACC1LLI_bit

