una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
__IO_REG32_BIT(DMACC1CONTROL,         0x4000212C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C1CONTROL      DMACC1CONTROL
#define GPDMA_C1CONTROL_bit  DMACC1CONTROL_bit

__IO_REG32_BIT(DMACC1CONFIGURATION,   0x40002130,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C1CONFIG      DMACC1CONFIGURATION
#define GPDMA_C1CONFIG_bit  DMACC1CONFIGURATION_bit

__IO_REG32(    DMACC2SRCADDR,         0x40002140,__READ_WRITE);
#define GPDMA_C2SRCADDR      DMACC2SRCADDR

__IO_REG32(    DMACC2DESTADDR,        0x40002144,__READ_WRITE);
#define GPDMA_C2DESTADDR      DMACC2DESTADDR

__IO_REG32_BIT(DMACC2LLI,             0x40002148,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C2LLI      DMACC2LLI
#define GPDMA_C2LLI_bit  DMACC2LLI_bit

__IO_REG32_BIT(DMACC2CONTROL,         0x4000214C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C2CONTROL      DMACC2CONTROL
#define GPDMA_C2CONTROL_bit  DMACC2CONTROL_bit

__IO_REG32_BIT(DMACC2CONFIGURATION,   0x40002150,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C2CONFIG      DMACC2CONFIGURATION
#define GPDMA_C2CONFIG_bit  DMACC2CONFIGURATION_bit

__IO_REG32(    DMACC3SRCADDR,         0x40002160,__READ_WRITE);
#define GPDMA_C3SRCADDR      DMACC3SRCADDR

__IO_REG32(    DMACC3DESTADDR,        0x40002164,__READ_WRITE);
#define GPDMA_C3DESTADDR      DMACC3DESTADDR

__IO_REG32_BIT(DMACC3LLI,             0x40002168,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C3LLI      DMACC3LLI
#define GPDMA_C3LLI_bit  DMACC3LLI_bit

__IO_REG32_BIT(DMACC3CONTROL,         0x4000216C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C3CONTROL      DMACC3CONTROL
#define GPDMA_C3CONTROL_bit  DMACC3CONTROL_bit

__IO_REG32_BIT(DMACC3CONFIGURATION,   0x40002170,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C3CONFIG      DMACC3CONFIGURATION
#define GPDMA_C3CONFIG_bit  DMACC3CONFIGURATION_bit

__IO_REG32(    DMACC4SRCADDR,         0x40002180,__READ_WRITE);
#define GPDMA_C4SRCADDR      DMACC4SRCADDR

__IO_REG32(    DMACC4DESTADDR,        0x40002184,__READ_WRITE);
#define GPDMA_C4DESTADDR      DMACC4DESTADDR

__IO_REG32_BIT(DMACC4LLI,             0x40002188,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C4LLI      DMACC4LLI
#define GPDMA_C4LLI_bit  DMACC4LLI_bit

__IO_REG32_BIT(DMACC4CONTROL,         0x4000218C,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C4CONTROL      DMACC4CONTROL
#define GPDMA_C4CONTROL_bit  DMACC4CONTROL_bit

__IO_REG32_BIT(DMACC4CONFIGURATION,   0x40002190,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C4CONFIG      DMACC4CONFIGURATION
#define GPDMA_C4CONFIG_bit  DMACC4CONFIGURATION_bit

__IO_REG32(    DMACC5SRCADDR,         0x400021A0,__READ_WRITE);
#define GPDMA_C5SRCADDR      DMACC5SRCADDR

__IO_REG32(    DMACC5DESTADDR,        0x400021A4,__READ_WRITE);
#define GPDMA_C5DESTADDR      DMACC5DESTADDR

__IO_REG32_BIT(DMACC5LLI,             0x400021A8,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C5LLI      DMACC5LLI
#define GPDMA_C5LLI_bit  DMACC5LLI_bit

__IO_REG32_BIT(DMACC5CONTROL,         0x400021AC,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C5CONTROL      DMACC5CONTROL
#define GPDMA_C5CONTROL_bit  DMACC5CONTROL_bit

__IO_REG32_BIT(DMACC5CONFIGURATION,   0x400021B0,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C5CONFIG      DMACC5CONFIGURATION
#define GPDMA_C5CONFIG_bit  DMACC5CONFIGURATION_bit

__IO_REG32(    DMACC6SRCADDR,         0x400021C0,__READ_WRITE);
#define GPDMA_C6SRCADDR      DMACC6SRCADDR

__IO_REG32(    DMACC6DESTADDR,        0x400021C4,__READ_WRITE);
#define GPDMA_C6DESTADDR      DMACC6DESTADDR

__IO_REG32_BIT(DMACC6LLI,             0x400021C8,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C6LLI      DMACC6LLI
#define GPDMA_C6LLI_bit  DMACC6LLI_bit

__IO_REG32_BIT(DMACC6CONTROL,         0x400021CC,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C6CONTROL      DMACC6CONTROL
#define GPDMA_C6CONTROL_bit  DMACC6CONTROL_bit

__IO_REG32_BIT(DMACC6CONFIGURATION,   0x400021D0,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C6CONFIG      DMACC6CONFIGURATION
#define GPDMA_C6CONFIG_bit  DMACC6CONFIGURATION_bit

__IO_REG32(    DMACC7SRCADDR,         0x400021E0,__READ_WRITE);
#define GPDMA_C7SRCADDR      DMACC7SRCADDR

__IO_REG32(    DMACC7DESTADDR,        0x400021E4,__READ_WRITE);
#define GPDMA_C7DESTADDR      DMACC7DESTADDR

__IO_REG32_BIT(DMACC7LLI,             0x400021E8,__READ_WRITE,__dma_lli_bits);
#define GPDMA_C7LLI      DMACC7LLI
#define GPDMA_C7LLI_bit  DMACC7LLI_bit

__IO_REG32_BIT(DMACC7CONTROL,         0x400021EC,__READ_WRITE,__dma_ctrl_bits);
#define GPDMA_C7CONTROL      DMACC7CONTROL
#define GPDMA_C7CONTROL_bit  DMACC7CONTROL_bit

__IO_REG32_BIT(DMACC7CONFIGURATION,   0x400021F0,__READ_WRITE,__dma_cfg_bits);
#define GPDMA_C7CONFIG      DMACC7CONFIGURATION
#define GPDMA_C7CONFIG_bit  DMACC7CONFIGURATION_bit

/***************************************************************************
 **
 ** SDIO
 **
 ***************************************************************************/
__IO_REG32_BIT(SDIO_CTRL,             0x40004000,__READ_WRITE ,__sdio_ctrl_bits);
__IO_REG32_BIT(SDIO_PWREN,            0x40004004,__READ_WRITE ,__sdio_pwren_bits);
__IO_REG32_BIT(SDIO_CLKDIV,           0x40004008,__READ_WRITE ,__sdio_clkdiv_bits);
__IO_REG32_BIT(SDIO_CLKSRC,           0x4000400C,__READ_WRITE ,__sdio_clksrc_bits);
__IO_REG32_BIT(SDIO_CLKENA,           0x40004010,__READ_WRITE ,__sdio_clkena_bits);
__IO_REG32_BIT(SDIO_TMOUT,            0x40004014,__READ_WRITE ,__sdio_tmout_bits);
__IO_REG32_BIT(SDIO_CTYPE,            0x40004018,__READ_WRITE ,__sdio_ctype_bits);
__IO_REG32_BIT(SDIO_BLKSIZ,           0x4000401C,__READ_WRITE ,__sdio_blksiz_bits);
__IO_REG32(    SDIO_BYTCNT,           0x40004020,__READ_WRITE );
__IO_REG32_BIT(SDIO_INTMASK,          0x40004024,__READ_WRITE ,__sdio_intmask_bits);
__IO_REG32(    SDIO_CMDARG,           0x40004028,__READ_WRITE );
__IO_REG32_BIT(SDIO_CMD,              0x4000402C,__READ_WRITE ,__sdio_cmd_bits);
__IO_REG32(    SDIO_RESP0,            0x40004030,__READ       );
__IO_REG32(    SDIO_RESP1,            0x40004034,__READ       );
__IO_REG32(    SDIO_RESP2,            0x40004038,__READ       );
__IO_REG32(    SDIO_RESP3,            0x4000403C,__READ       );
__IO_REG32_BIT(SDIO_MINTSTS,          0x40004040,__READ       ,__sdio_mintsts_bits);
__IO_REG32_BIT(SDIO_RINTSTS,          0x40004044,__READ_WRITE ,__sdio_rintsts_bits);
__IO_REG32_BIT(SDIO_STATUS,           0x40004048,__READ       ,__sdio_status_bits);
__IO_REG32_BIT(SDIO_FIFOTH,           0x4000404C,__READ_WRITE ,__sdio_fifoth_bits);
__IO_REG32_BIT(SDIO_CDETECT,          0x40004050,__READ       ,__sdio_cdetect_bits);
__IO_REG32_BIT(SDIO_WRTPRT,           0x40004054,__READ       ,__sdio_wrtprt_bits);
/*__IO_REG32_BIT(SDIO_GPIO,             0x40004058,__READ_WRITE ,__sdio_gpio_bits);*/
__IO_REG32(    SDIO_TCBCNT,           0x4000405C,__READ       );
__IO_REG32(    SDIO_TBBCNT,           0x40004060,__READ       );
__IO_REG32_BIT(SDIO_DEBNCE,           0x40004064,__READ_WRITE ,__sdio_debnce_bits);
/*__IO_REG32(    SDIO_USRID,            0x40004068,__READ_WRITE );*/
/*__IO_REG32(    SDIO_VERID,            0x4000406C,__READ       );*/
__IO_REG32_BIT(SDIO_UHS_REG,          0x40004074,__READ_WRITE ,__sdio_uhs_reg_bits);
__IO_REG32_BIT(SDIO_RST_N,            0x40004078,__READ_WRITE ,__sdio_rst_n_bits);
__IO_REG32_BIT(SDIO_BMOD,             0x40004080,__READ_WRITE ,__sdio_bmod_bits);
__IO_REG32(    SDIO_PLDMND,           0x40004084,__WRITE      );
__IO_REG32(    SDIO_DBADDR,           0x40004088,__READ_WRITE );
__IO_REG32_BIT(SDIO_IDSTS,            0x4000408C,__READ_WRITE ,__sdio_idsts_bits);
__IO_REG32_BIT(SDIO_IDINTEN,          0x40004090,__READ_WRITE ,__sdio_idinten_bits);
__IO_REG32(    SDIO_DSCADDR,          0x40004094,__READ       );
__IO_REG32(    SDIO_BUFADDR,          0x40004098,__READ       );
__IO_REG32(    SDIO_DATA,             0x40004100,__READ_WRITE );

/***************************************************************************
 **
 ** EMC
 **
 ***************************************************************************/
__IO_REG32_BIT(EMC_CONTROL,            0x40005000,__READ_WRITE ,__emc_control_bits);
__IO_REG32_BIT(EMC_STATUS,             0x40005004,__READ       ,__emc_status_bits);
__IO_REG32_BIT(EMC_CONFIG,             0x40005008,__READ_WRITE ,__emc_config_bits);
__IO_REG32_BIT(EMC_DYNAMICCONTROL,     0x40005020,__READ_WRITE ,__emc_dctrl_bits);
__IO_REG32_BIT(EMC_DYNAMICREFRESH,     0x40005024,__READ_WRITE ,__emc_drfr_bits);
__IO_REG32_BIT(EMC_DYNAMICREADCONFIG,  0x40005028,__READ_WRITE ,__emc_drdcfg_bits);
__IO_REG32_BIT(EMC_DYNAMICRP,          0x40005030,__READ_WRITE ,__emc_drp_bits);
__IO_REG32_BIT(EMC_DYNAMICRAS,         0x40005034,__READ_WRITE ,__emc_dras_bits);
__IO_REG32_BIT(EMC_DYNAMICSREX,        0x40005038,__READ_WRITE ,__emc_dsrex_bits);
__IO_REG32_BIT(EMC_DYNAMICAPR,         0x4000503C,__READ_WRITE ,__emc_dapr_bits);
__IO_REG32_BIT(EMC_DYNAMICDAL,         0x40005040,__READ_WRITE ,__emc_ddal_bits);
__IO_REG32_BIT(EMC_DYNAMICWR,          0x40005044,__READ_WRITE ,__emc_dwr_bits);
__IO_REG32_BIT(EMC_DYNAMICRC,          0x40005048,__READ_WRITE ,__emc_drc_bits);
__IO_REG32_BIT(EMC_DYNAMICRFC,         0x4000504C,__READ_WRITE ,__emc_drfc_bits);
__IO_REG32_BIT(EMC_DYNAMICXSR,         0x40005050,__READ_WRITE ,__emc_dxsr_bits);
__IO_REG32_BIT(EMC_DYNAMICRRD,         0x40005054,__READ_WRITE ,__emc_drrd_bits);
__IO_REG32_BIT(EMC_DYNAMICMRD,         0x40005058,__READ_WRITE ,__emc_dmrd_bits);
__IO_REG32_BIT(EMC_STATICEXTENDEDWAIT, 0x40005080,__READ_WRITE ,__emc_s_ext_wait_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG0,     0x40005100,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS0,     0x40005104,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG1,     0x40005120,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS1,     0x40005124,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG2,     0x40005140,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS2,     0x40005144,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_DYNAMICCONFIG3,     0x40005160,__READ_WRITE ,__emc_d_config_bits);
__IO_REG32_BIT(EMC_DYNAMICRASCAS3,     0x40005164,__READ_WRITE ,__emc_d_ras_cas_bits);
__IO_REG32_BIT(EMC_STATICCONFIG0,      0x40005200,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN0,     0x40005204,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN0,     0x40005208,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD0,      0x4000520C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE0,    0x40005210,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR0,      0x40005214,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN0,    0x40005218,__READ_WRITE ,__emc_s_wait_turn_bits);
__IO_REG32_BIT(EMC_STATICCONFIG1,      0x40005220,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN1,     0x40005224,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN1,     0x40005228,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD1,      0x4000522C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE1,    0x40005230,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR1,      0x40005234,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN1,    0x40005238,__READ_WRITE ,__emc_s_wait_turn_bits);
__IO_REG32_BIT(EMC_STATICCONFIG2,      0x40005240,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN2,     0x40005244,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN2,     0x40005248,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD2,      0x4000524C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE2,    0x40005250,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR2,      0x40005254,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN2,    0x40005258,__READ_WRITE ,__emc_s_wait_turn_bits);
__IO_REG32_BIT(EMC_STATICCONFIG3,      0x40005260,__READ_WRITE ,__emc_s_config_bits);
__IO_REG32_BIT(EMC_STATICWAITWEN3,     0x40005264,__READ_WRITE ,__emc_s_wait_wen_bits);
__IO_REG32_BIT(EMC_STATICWAITOEN3,     0x40005268,__READ_WRITE ,__emc_s_wait_oen_bits);
__IO_REG32_BIT(EMC_STATICWAITRD3,      0x4000526C,__READ_WRITE ,__emc_s_wait_rd_bits);
__IO_REG32_BIT(EMC_STATICWAITPAGE3,    0x40005270,__READ_WRITE ,__emc_s_wait_pg_bits);
__IO_REG32_BIT(EMC_STATICWAITWR3,      0x40005274,__READ_WRITE ,__emc_s_wait_wr_bits);
__IO_REG32_BIT(EMC_STATICWAITTURN3,    0x40005278,__READ_WRITE ,__emc_s_wait_turn_bits);

/***************************************************************************
 **
 ** SCT
 **
 ***************************************************************************/
__IO_REG32_BIT(SCT_CONFIG,             0x40000000,__READ_WRITE ,__sct_config_bits);
__IO_REG32_BIT(SCT_CTRL,               0x40000004,__READ_WRITE ,__sct_ctrl_bits);
#define SCT_CTRL_L       SCT_CTRL_bit.__sct_ctrl_l
#define SCT_CTRL_L_bit   SCT_CTRL_bit.__sct_ctrl_l_bits
#define SCT_CTRL_H       SCT_CTRL_bit.__sct_ctrl_h
#define SCT_CTRL_H_bit   SCT_CTRL_bit.__sct_ctrl_h_bits
__IO_REG32_BIT(SCT_LIMIT,              0x40000008,__READ_WRITE ,__sct_limit_bits);
#define SCT_LIMIT_L       SCT_LIMIT_bit.__sct_limit_l
#define SCT_LIMIT_L_bit   SCT_LIMIT_bit.__sct_limit_l_bits
#define SCT_LIMIT_H       SCT_LIMIT_bit.__sct_limit_h
#define SCT_LIMIT_H_bit   SCT_LIMIT_bit.__sct_limit_h_bits
__IO_REG32_BIT(SCT_HALT,               0x4000000C,__READ_WRITE ,__sct_halt_bits);
#define SCT_HALT_L       SCT_HALT_bit.__sct_halt_l
#define SCT_HALT_L_bit   SCT_HALT_bit.__sct_halt_l_bits
#define SCT_HALT_H       SCT_HALT_bit.__sct_halt_h
#define SCT_HALT_H_bit   SCT_HALT_bit.__sct_halt_h_bits
__IO_REG32_BIT(SCT_STOP,               0x40000010,__READ_WRITE ,__sct_stop_bits);
#define SCT_STOP_L       SCT_STOP_bit.__sct_stop_l
#define SCT_STOP_L_bit   SCT_STOP_bit.__sct_stop_l_bits
#define SCT_STOP_H       SCT_STOP_bit.__sct_stop_h
#define SCT_STOP_H_bit   SCT_STOP_bit.__sct_stop_h_bits
__IO_REG32_BIT(SCT_START,              0x40000014,__READ_WRITE ,__sct_start_bits);
#define SCT_START_L       SCT_START_bit.__sct_start_l
#define SCT_START_L_bit   SCT_START_bit.__sct_start_l_bits
#define SCT_START_H       SCT_START_bit.__sct_start_h
#define SCT_START_H_bit   SCT_START_bit.__sct_start_h_bits
__IO_REG32_BIT(SCT_COUNT,              0x40000040,__READ_WRITE ,__sct_count_bits);
#define SCT_COUNT_L       SCT_COUNT_bit.__sct_count_l
#define SCT_COUNT_H       SCT_COUNT_bit.__sct_count_h
__IO_REG32_BIT(SCT_STATE,              0x40000044,__READ_WRITE ,__sct_state_bits);
#define SCT_STATE_L       SCT_STATE_bit.__sct_state_l
#define SCT_STATE_L_bit   SCT_STATE_bit.__sct_state_l_bits
#define SCT_STATE_H       SCT_STATE_bit.__sct_state_h
#define SCT_STATE_H_bit   SCT_STATE_bit.__sct_state_h_bits
__IO_REG32_BIT(SCT_INPUT,              0x40000048,__READ       ,__sct_input_bits);
__IO_REG32_BIT(SCT_REGMODE,            0x4000004C,__READ_WRITE ,__sct_regmode_bits);
#define SCT_REGMODE_L       SCT_REGMODE_bit.__sct_regmode_l
#define SCT_REGMODE_L_bit   SCT_REGMODE_bit.__sct_regmode_l_bits
#define SCT_REGMODE_H       SCT_REGMODE_bit.__sct_regmode_h
#define SCT_REGMODE_H_bit   SCT_REGMODE_bit.__sct_regmode_h_bits
__IO_REG32_BIT(SCT_OUTPUT,             0x40000050,__READ_WRITE ,__sct_output_bits);
__IO_REG32_BIT(SCT_OUTPUTDIRCTRL,      0x40000054,__READ_WRITE ,__sct_outputdirctrl_bits);
__IO_REG32_BIT(SCT_RES,                0x40000058,__READ_WRITE ,__sct_res_bits);
__IO_REG32_BIT(SCT_DMAREQ0,            0x4000005C,__READ_WRITE ,__sct_dmareq0_bits);
__IO_REG32_BIT(SCT_DMAREQ1,            0x40000060,__READ_WRITE ,__sct_dmareq1_bits);
__IO_REG32_BIT(SCT_EVEN,               0x400000F0,__READ_WRITE ,__sct_even_bits);
__IO_REG32_BIT(SCT_EVFLAG,             0x400000F4,__READ_WRITE ,__sct_evflag_bits);
__IO_REG32_BIT(SCT_CONEN,              0x400000F8,__READ_WRITE ,__sct_conen_bits);
__IO_REG32_BIT(SCT_CONFLAG,            0x400000FC,__READ_WRITE ,__sct_conflag_bits);
__IO_REG32_BIT(SCT_MATCH0,             0x40000100,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP0             SCT_MATCH0
#define SCT_CAP0_bit         SCT_MATCH0_bit
#define SCT_MATCH0_L         SCT_MATCH0_bit.__sct_match_cap_l
#define SCT_MATCH0_H         SCT_MATCH0_bit.__sct_match_cap_h
#define SCT_CAP0_L           SCT_MATCH0_bit.__sct_match_cap_l
#define SCT_CAP0_H           SCT_MATCH0_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH1,             0x40000104,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP1             SCT_MATCH1
#define SCT_CAP1_bit         SCT_MATCH1_bit
#define SCT_MATCH1_L         SCT_MATCH1_bit.__sct_match_cap_l
#define SCT_MATCH1_H         SCT_MATCH1_bit.__sct_match_cap_h
#define SCT_CAP1_L           SCT_MATCH1_bit.__sct_match_cap_l
#define SCT_CAP1_H           SCT_MATCH1_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH2,             0x40000108,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP2             SCT_MATCH2
#define SCT_CAP2_bit         SCT_MATCH2_bit
#define SCT_MATCH2_L         SCT_MATCH2_bit.__sct_match_cap_l
#define SCT_MATCH2_H         SCT_MATCH2_bit.__sct_match_cap_h
#define SCT_CAP2_L           SCT_MATCH2_bit.__sct_match_cap_l
#define SCT_CAP2_H           SCT_MATCH2_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH3,             0x4000010C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP3             SCT_MATCH3
#define SCT_CAP3_bit         SCT_MATCH3_bit
#define SCT_MATCH3_L         SCT_MATCH3_bit.__sct_match_cap_l
#define SCT_MATCH3_H         SCT_MATCH3_bit.__sct_match_cap_h
#define SCT_CAP3_L           SCT_MATCH3_bit.__sct_match_cap_l
#define SCT_CAP3_H           SCT_MATCH3_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH4,             0x40000110,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP4             SCT_MATCH4
#define SCT_CAP4_bit         SCT_MATCH4_bit
#define SCT_MATCH4_L         SCT_MATCH4_bit.__sct_match_cap_l
#define SCT_MATCH4_H         SCT_MATCH4_bit.__sct_match_cap_h
#define SCT_CAP4_L           SCT_MATCH4_bit.__sct_match_cap_l
#define SCT_CAP4_H           SCT_MATCH4_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH5,             0x40000114,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP5             SCT_MATCH5
#define SCT_CAP5_bit         SCT_MATCH5_bit
#define SCT_MATCH5_L         SCT_MATCH5_bit.__sct_match_cap_l
#define SCT_MATCH5_H         SCT_MATCH5_bit.__sct_match_cap_h
#define SCT_CAP5_L           SCT_MATCH5_bit.__sct_match_cap_l
#define SCT_CAP5_H           SCT_MATCH5_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH6,             0x40000118,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP6             SCT_MATCH6
#define SCT_CAP6_bit         SCT_MATCH6_bit
#define SCT_MATCH6_L         SCT_MATCH6_bit.__sct_match_cap_l
#define SCT_MATCH6_H         SCT_MATCH6_bit.__sct_match_cap_h
#define SCT_CAP6_L           SCT_MATCH6_bit.__sct_match_cap_l
#define SCT_CAP6_H           SCT_MATCH6_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH7,             0x4000011C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP7             SCT_MATCH7
#define SCT_CAP7_bit         SCT_MATCH7_bit
#define SCT_MATCH7_L         SCT_MATCH7_bit.__sct_match_cap_l
#define SCT_MATCH7_H         SCT_MATCH7_bit.__sct_match_cap_h
#define SCT_CAP7_L           SCT_MATCH7_bit.__sct_match_cap_l
#define SCT_CAP7_H           SCT_MATCH7_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH8,             0x40000120,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP8             SCT_MATCH8
#define SCT_CAP8_bit         SCT_MATCH8_bit
#define SCT_MATCH8_L         SCT_MATCH8_bit.__sct_match_cap_l
#define SCT_MATCH8_H         SCT_MATCH8_bit.__sct_match_cap_h
#define SCT_CAP8_L           SCT_MATCH8_bit.__sct_match_cap_l
#define SCT_CAP8_H           SCT_MATCH8_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH9,             0x40000124,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP9             SCT_MATCH9
#define SCT_CAP9_bit         SCT_MATCH9_bit
#define SCT_MATCH9_L         SCT_MATCH9_bit.__sct_match_cap_l
#define SCT_MATCH9_H         SCT_MATCH9_bit.__sct_match_cap_h
#define SCT_CAP9_L           SCT_MATCH9_bit.__sct_match_cap_l
#define SCT_CAP9_H           SCT_MATCH9_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH10,            0x40000128,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP10            SCT_MATCH10
#define SCT_CAP10_bit        SCT_MATCH10_bit
#define SCT_MATCH10_L        SCT_MATCH10_bit.__sct_match_cap_l
#define SCT_MATCH10_H        SCT_MATCH10_bit.__sct_match_cap_h
#define SCT_CAP10_L          SCT_MATCH10_bit.__sct_match_cap_l
#define SCT_CAP10_H          SCT_MATCH10_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH11,            0x4000012C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP11            SCT_MATCH11
#define SCT_CAP11_bit        SCT_MATCH11_bit
#define SCT_MATCH11_L        SCT_MATCH11_bit.__sct_match_cap_l
#define SCT_MATCH11_H        SCT_MATCH11_bit.__sct_match_cap_h
#define SCT_CAP11_L          SCT_MATCH11_bit.__sct_match_cap_l
#define SCT_CAP11_H          SCT_MATCH11_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH12,            0x40000130,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP12            SCT_MATCH12
#define SCT_CAP12_bit        SCT_MATCH12_bit
#define SCT_MATCH12_L        SCT_MATCH12_bit.__sct_match_cap_l
#define SCT_MATCH12_H        SCT_MATCH12_bit.__sct_match_cap_h
#define SCT_CAP12_L          SCT_MATCH12_bit.__sct_match_cap_l
#define SCT_CAP12_H          SCT_MATCH12_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH13,            0x40000134,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP13            SCT_MATCH13
#define SCT_CAP13_bit        SCT_MATCH13_bit
#define SCT_MATCH13_L        SCT_MATCH13_bit.__sct_match_cap_l
#define SCT_MATCH13_H        SCT_MATCH13_bit.__sct_match_cap_h
#define SCT_CAP13_L          SCT_MATCH13_bit.__sct_match_cap_l
#define SCT_CAP13_H          SCT_MATCH13_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH14,            0x40000138,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP14            SCT_MATCH14
#define SCT_CAP14_bit        SCT_MATCH14_bit
#define SCT_MATCH14_L        SCT_MATCH14_bit.__sct_match_cap_l
#define SCT_MATCH14_H        SCT_MATCH14_bit.__sct_match_cap_h
#define SCT_CAP14_L          SCT_MATCH14_bit.__sct_match_cap_l
#define SCT_CAP14_H          SCT_MATCH14_bit.__sct_match_cap_h
__IO_REG32_BIT(SCT_MATCH15,            0x4000013C,__READ_WRITE ,__sct_match_cap_bits);
#define SCT_CAP15            SCT_MATCH15
#define SCT_CAP15_bit        SCT_MATCH15_bit
#define SCT_MATCH15_L        SCT_MATCH15_bit.__sct_match_cap_l
#define SCT_MATCH15_H        SCT_MATCH15_bit.__sct_match_cap_h
#define SCT_CAP15_L          SCT_MATCH15_bit.__sct_match_cap_l
#define SCT_CAP15_H          SCT_MATCH15_bit.__sct_match_cap_h

