una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
__IO_REG32_BIT(U0LCR,                 0x4008100C,__READ_WRITE ,__uart_lcr_bits);
__IO_REG32_BIT(U0LSR,                 0x40081014,__READ       ,__uart_lsr_bits);
__IO_REG32_BIT(U0SCR,                 0x4008101C,__READ_WRITE ,__uart_scr_bits);
__IO_REG32_BIT(U0ACR,                 0x40081020,__READ_WRITE ,__uart_acr_bits);
__IO_REG32_BIT(U0FDR,                 0x40081028,__READ_WRITE ,__uart_fdr_bits);
__IO_REG32_BIT(U0OSR,                 0x4008102C,__READ_WRITE ,__uart_osr_bits);
__IO_REG32_BIT(U0HDEN,                0x40081040,__READ_WRITE ,__uart_hden_bits);
__IO_REG32_BIT(U0SCICTRL,             0x40081048,__READ_WRITE ,__uart_scictrl_bits);
__IO_REG32_BIT(U0RS485CTRL,           0x4008104C,__READ_WRITE ,__uart_rs485ctrl_bits);
__IO_REG32_BIT(U0RS485ADRMATCH,       0x40081050,__READ_WRITE ,__uart_rs485adrmatch_bits);
__IO_REG32_BIT(U0RS485DLY,            0x40081054,__READ_WRITE ,__uart_rs485dly_bits);
__IO_REG32_BIT(U0SYNCCTRL,            0x40081058,__READ_WRITE ,__uart_syncctrl_bits);
__IO_REG32_BIT(U0TER,                 0x4008105C,__READ_WRITE ,__uart_ter_bits);

/***************************************************************************
 **
 **  UART1
 **
 ***************************************************************************/
/* U1DLL, U1RBR and U1THR share the same address */
__IO_REG32_BIT(U1RBR,                 0x40082000,__READ_WRITE  ,__uart_rbr_bits);
#define U1THR         U1RBR
#define U1THR_bit     U1RBR_bit
#define U1DLL         U1RBR
#define U1DLL_bit     U1RBR_bit

/* U1DLM and U1IER share the same address */
__IO_REG32_BIT(U1IER,                 0x40082004,__READ_WRITE ,__uart1_ier_bits);
#define U1DLM      U1IER
#define U1DLM_bit  U1IER_bit
/* U1FCR and U1IIR share the same address */
__IO_REG32_BIT(U1FCR,                 0x40082008,__READ_WRITE ,__uart_fcriir_bits);
#define U1IIR      U1FCR
#define U1IIR_bit  U1FCR_bit

__IO_REG32_BIT(U1LCR,                 0x4008200C,__READ_WRITE ,__uart_lcr_bits);
__IO_REG32_BIT(U1MCR,                 0x40082010,__READ_WRITE ,__uart1_mcr_bits);
__IO_REG32_BIT(U1LSR,                 0x40082014,__READ       ,__uart1_lsr_bits);
__IO_REG32_BIT(U1MSR,                 0x40082018,__READ       ,__uart1_msr_bits);
__IO_REG32_BIT(U1SCR,                 0x4008201C,__READ_WRITE ,__uart1_scr_bits);
__IO_REG32_BIT(U1ACR,                 0x40082020,__READ_WRITE ,__uart_acr_bits);
__IO_REG32_BIT(U1FDR,                 0x40082028,__READ_WRITE ,__uart_fdr_bits);
__IO_REG32_BIT(U1TER,                 0x40082030,__READ_WRITE ,__uart1_ter_bits);
__IO_REG32_BIT(U1RS485CTRL,           0x4008204C,__READ_WRITE ,__uart1_rs485ctrl_bits);
__IO_REG32_BIT(U1RS485ADRMATCH,       0x40082050,__READ_WRITE ,__uart_rs485adrmatch_bits);
__IO_REG32_BIT(U1RS485DLY,            0x40082054,__READ_WRITE ,__uart_rs485dly_bits);
__IO_REG32_BIT(U1FIFOLVL,             0x40082058,__READ_WRITE ,__uart1_fifolvl_bits);

/***************************************************************************
 **
 **  UART2
 **
 ***************************************************************************/
/* U2DLL, U2RBR and U2THR share the same address */
__IO_REG32_BIT(U2RBR,                 0x400C1000,__READ_WRITE  ,__uart_rbr_bits);
#define U2THR         U2RBR
#define U2THR_bit     U2RBR_bit
#define U2DLL         U2RBR
#define U2DLL_bit     U2RBR_bit

/* U2DLM and U2IER share the same address */
__IO_REG32_BIT(U2IER,                 0x400C1004,__READ_WRITE ,__uart_ier_bits);
#define U2DLM      U2IER
#define U2DLM_bit  U2IER_bit
/* U2FCR and U2IIR share the same address */
__IO_REG32_BIT(U2FCR,                 0x400C1008,__READ_WRITE ,__uart_fcriir_bits);
#define U2IIR      U2FCR
#define U2IIR_bit  U2FCR_bit

__IO_REG32_BIT(U2LCR,                 0x400C100C,__READ_WRITE ,__uart_lcr_bits);
__IO_REG32_BIT(U2LSR,                 0x400C1014,__READ       ,__uart_lsr_bits);
__IO_REG32_BIT(U2SCR,                 0x400C101C,__READ_WRITE ,__uart_scr_bits);
__IO_REG32_BIT(U2ACR,                 0x400C1020,__READ_WRITE ,__uart_acr_bits);
__IO_REG32_BIT(U2FDR,                 0x400C1028,__READ_WRITE ,__uart_fdr_bits);
__IO_REG32_BIT(U2OSR,                 0x400C102C,__READ_WRITE ,__uart_osr_bits);
__IO_REG32_BIT(U2HDEN,                0x400C1040,__READ_WRITE ,__uart_hden_bits);
__IO_REG32_BIT(U2SCICTRL,             0x400C1048,__READ_WRITE ,__uart_scictrl_bits);
__IO_REG32_BIT(U2RS485CTRL,           0x400C104C,__READ_WRITE ,__uart_rs485ctrl_bits);
__IO_REG32_BIT(U2ADRMATCH,            0x400C1050,__READ_WRITE ,__uart_rs485adrmatch_bits);
__IO_REG32_BIT(U2RS485DLY,            0x400C1054,__READ_WRITE ,__uart_rs485dly_bits);
__IO_REG32_BIT(U2SYNCCTRL,            0x400C1058,__READ_WRITE ,__uart_syncctrl_bits);
__IO_REG32_BIT(U2TER,                 0x400C105C,__READ_WRITE ,__uart_ter_bits);

/***************************************************************************
 **
 **  UART3
 **
 ***************************************************************************/
/* U3DLL, U3RBR and U3THR share the same address */
__IO_REG32_BIT(U3RBR,                 0x400C2000,__READ_WRITE  ,__uart_rbr_bits);
#define U3THR         U3RBR
#define U3THR_bit     U3RBR_bit
#define U3DLL         U3RBR
#define U3DLL_bit     U3RBR_bit

/* U3DLM and U3IER share the same address */
__IO_REG32_BIT(U3IER,                 0x400C2004,__READ_WRITE ,__uart_ier_bits);
#define U3DLM      U3IER
#define U3DLM_bit  U3IER_bit
/* U3FCR and U3IIR share the same address */
__IO_REG32_BIT(U3FCR,                 0x400C2008,__READ_WRITE ,__uart_fcriir_bits);
#define U3IIR      U3FCR
#define U3IIR_bit  U3FCR_bit

__IO_REG32_BIT(U3LCR,                 0x400C200C,__READ_WRITE ,__uart_lcr_bits);
__IO_REG32_BIT(U3LSR,                 0x400C2014,__READ       ,__uart_lsr_bits);
__IO_REG32_BIT(U3SCR,                 0x400C201C,__READ_WRITE ,__uart_scr_bits);
__IO_REG32_BIT(U3ACR,                 0x400C2020,__READ_WRITE ,__uart_acr_bits);
__IO_REG32_BIT(U3ICR,                 0x400C2024,__READ_WRITE ,__uart_icr_bits);
__IO_REG32_BIT(U3FDR,                 0x400C2028,__READ_WRITE ,__uart_fdr_bits);
__IO_REG32_BIT(U3OSR,                 0x400C202C,__READ_WRITE ,__uart_osr_bits);
__IO_REG32_BIT(U3HDEN,                0x400C2040,__READ_WRITE ,__uart_hden_bits);
__IO_REG32_BIT(U3SCICTRL,             0x400C2048,__READ_WRITE ,__uart_scictrl_bits);
__IO_REG32_BIT(U3RS485CTRL,           0x400C204C,__READ_WRITE ,__uart_rs485ctrl_bits);
__IO_REG32_BIT(U3ADRMATCH,            0x400C2050,__READ_WRITE ,__uart_rs485adrmatch_bits);
__IO_REG32_BIT(U3RS485DLY,            0x400C2054,__READ_WRITE ,__uart_rs485dly_bits);
__IO_REG32_BIT(U3SYNCCTRL,            0x400C2058,__READ_WRITE ,__uart_syncctrl_bits);
__IO_REG32_BIT(U3TER,                 0x400C205C,__READ_WRITE ,__uart_ter_bits);

/***************************************************************************
 **
 ** SSP0
 **
 ***************************************************************************/
__IO_REG32_BIT(SSP0_CR0,               0x40083000,__READ_WRITE ,__ssp_cr0_bits);
__IO_REG32_BIT(SSP0_CR1,               0x40083004,__READ_WRITE ,__ssp_cr1_bits);
__IO_REG32_BIT(SSP0_DR,                0x40083008,__READ_WRITE ,__ssp_dr_bits);
__IO_REG32_BIT(SSP0_SR,                0x4008300C,__READ       ,__ssp_sr_bits);
__IO_REG32_BIT(SSP0_CPSR,              0x40083010,__READ_WRITE ,__ssp_cpsr_bits);
__IO_REG32_BIT(SSP0_IMSC,              0x40083014,__READ_WRITE ,__ssp_imsc_bits);
__IO_REG32_BIT(SSP0_RIS,               0x40083018,__READ       ,__ssp_ris_bits);
__IO_REG32_BIT(SSP0_MIS,               0x4008301C,__READ       ,__ssp_mis_bits);
__IO_REG32(    SSP0_ICR,               0x40083020,__WRITE      );
__IO_REG32_BIT(SSP0_DMACR,             0x40083024,__READ_WRITE ,__ssp_dmacr_bits);

/***************************************************************************
 **
 ** SSP1
 **
 ***************************************************************************/
__IO_REG32_BIT(SSP1_CR0,               0x400C5000,__READ_WRITE ,__ssp_cr0_bits);
__IO_REG32_BIT(SSP1_CR1,               0x400C5004,__READ_WRITE ,__ssp_cr1_bits);
__IO_REG32_BIT(SSP1_DR,                0x400C5008,__READ_WRITE ,__ssp_dr_bits);
__IO_REG32_BIT(SSP1_SR,                0x400C500C,__READ       ,__ssp_sr_bits);
__IO_REG32_BIT(SSP1_CPSR,              0x400C5010,__READ_WRITE ,__ssp_cpsr_bits);
__IO_REG32_BIT(SSP1_IMSC,              0x400C5014,__READ_WRITE ,__ssp_imsc_bits);
__IO_REG32_BIT(SSP1_RIS,               0x400C5018,__READ       ,__ssp_ris_bits);
__IO_REG32_BIT(SSP1_MIS,               0x400C501C,__READ       ,__ssp_mis_bits);
__IO_REG32(    SSP1_ICR,               0x400C5020,__WRITE      );
__IO_REG32_BIT(SSP1_DMACR,             0x400C5024,__READ_WRITE ,__ssp_dmacr_bits);

/***************************************************************************
 **
 ** SPI
 **
 ***************************************************************************/
__IO_REG32_BIT(SPI_CR,                  0x40100000,__READ_WRITE ,__spi_cr_bits);
__IO_REG32_BIT(SPI_SR,                  0x40100004,__READ       ,__spi_sr_bits);
__IO_REG32_BIT(SPI_DR,                  0x40100008,__READ_WRITE ,__spi_dr_bits);
__IO_REG32_BIT(SPI_CCR,                 0x4010000C,__READ_WRITE ,__spi_ccr_bits);
__IO_REG32_BIT(SPI_TCR,                 0x40100010,__READ_WRITE ,__spi_tcr_bits);
__IO_REG32_BIT(SPI_TSR,                 0x40100014,__READ_WRITE ,__spi_tsr_bits);
__IO_REG32_BIT(SPI_INT,                 0x4010001C,__READ_WRITE ,__spi_int_bits);

/***************************************************************************
 **
 ** CCAN0
 **
 ***************************************************************************/
__IO_REG32_BIT(CCAN0_CNTL,               0x400E2000,__READ_WRITE ,__can_cntl_bits);
__IO_REG32_BIT(CCAN0_STAT,               0x400E2004,__READ_WRITE ,__can_stat_bits);
__IO_REG32_BIT(CCAN0_EC,                 0x400E2008,__READ       ,__can_ec_bits);
__IO_REG32_BIT(CCAN0_BT,                 0x400E200C,__READ_WRITE ,__can_bt_bits);
__IO_REG32_BIT(CCAN0_INT,                0x400E2010,__READ       ,__can_int_bits);
__IO_REG32_BIT(CCAN0_TEST,               0x400E2014,__READ_WRITE ,__can_test_bits);
__IO_REG32_BIT(CCAN0_BRPE,               0x400E2018,__READ_WRITE ,__can_brpe_bits);
__IO_REG32_BIT(CCAN0_IF1_CMDREQ,         0x400E2020,__READ_WRITE ,__can_ifx_cmdreq_bits);
__IO_REG32_BIT(CCAN0_IF1_CMDMSK_W,       0x400E2024,__READ_WRITE ,__can_ifx_cmdmsk_bits);
#define CCAN0_IF1_CMDMSK_R      CCAN0_IF1_CMDMSK_W
#define CCAN0_IF1_CMDMSK_R_bit  CCAN0_IF1_CMDMSK_W_bit
__IO_REG32_BIT(CCAN0_IF1_MSK1,           0x400E2028,__READ_WRITE ,__can_ifx_msk1_bits);
__IO_REG32_BIT(CCAN0_IF1_MSK2,           0x400E202C,__READ_WRITE ,__can_ifx_msk2_bits);
__IO_REG32_BIT(CCAN0_IF1_ARB1,           0x400E2030,__READ_WRITE ,__can_ifx_arb1_bits);
__IO_REG32_BIT(CCAN0_IF1_ARB2,           0x400E2034,__READ_WRITE ,__can_ifx_arb2_bits);
__IO_REG32_BIT(CCAN0_IF1_MCTRL,          0x400E2038,__READ_WRITE ,__can_ifx_mctrl_bits);
__IO_REG32_BIT(CCAN0_IF1_DA1,            0x400E203C,__READ_WRITE ,__can_ifx_da1_bits);
__IO_REG32_BIT(CCAN0_IF1_DA2,            0x400E2040,__READ_WRITE ,__can_ifx_da2_bits);
__IO_REG32_BIT(CCAN0_IF1_DB1,            0x400E2044,__READ_WRITE ,__can_ifx_db1_bits);
__IO_REG32_BIT(CCAN0_IF1_DB2,            0x400E2048,__READ_WRITE ,__can_ifx_db2_bits);
__IO_REG32_BIT(CCAN0_IF2_CMDREQ,         0x400E2080,__READ_WRITE ,__can_ifx_cmdreq_bits);
__IO_REG32_BIT(CCAN0_IF2_CMDMSK_W,         0x400E2084,__READ_WRITE ,__can_ifx_cmdmsk_bits);
#define CCAN0_IF2_CMDMSK_R      CCAN0_IF2_CMDMSK_W
#define CCAN0_IF2_CMDMSK_R_bit  CCAN0_IF2_CMDMSK_W_bit
__IO_REG32_BIT(CCAN0_IF2_MSK1,           0x400E2088,__READ_WRITE ,__can_ifx_msk1_bits);
__IO_REG32_BIT(CCAN0_IF2_MSK2,           0x400E208C,__READ_WRITE ,__can_ifx_msk2_bits);
__IO_REG32_BIT(CCAN0_IF2_ARB1,           0x400E2090,__READ_WRITE ,__can_ifx_arb1_bits);
__IO_REG32_BIT(CCAN0_IF2_ARB2,           0x400E2094,__READ_WRITE ,__can_ifx_arb2_bits);
__IO_REG32_BIT(CCAN0_IF2_MCTRL,          0x400E2098,__READ_WRITE ,__can_ifx_mctrl_bits);
__IO_REG32_BIT(CCAN0_IF2_DA1,            0x400E209C,__READ_WRITE ,__can_ifx_da1_bits);
__IO_REG32_BIT(CCAN0_IF2_DA2,            0x400E20A0,__READ_WRITE ,__can_ifx_da2_bits);
__IO_REG32_BIT(CCAN0_IF2_DB1,            0x400E20A4,__READ_WRITE ,__can_ifx_db1_bits);
__IO_REG32_BIT(CCAN0_IF2_DB2,            0x400E20A8,__READ_WRITE ,__can_ifx_db2_bits);
__IO_REG32_BIT(CCAN0_TXREQ1,             0x400E2100,__READ       ,__can_txreq1_bits);
__IO_REG32_BIT(CCAN0_TXREQ2,             0x400E2104,__READ       ,__can_txreq2_bits);
__IO_REG32_BIT(CCAN0_ND1,                0x400E2120,__READ       ,__can_nd1_bits);
__IO_REG32_BIT(CCAN0_ND2,                0x400E2124,__READ       ,__can_nd2_bits);
__IO_REG32_BIT(CCAN0_IR1,                0x400E2140,__READ       ,__can_ir1_bits);
__IO_REG32_BIT(CCAN0_IR2,                0x400E2144,__READ       ,__can_ir2_bits);
__IO_REG32_BIT(CCAN0_MSGV1,              0x400E2160,__READ       ,__can_msgv1_bits);
__IO_REG32_BIT(CCAN0_MSGV2,              0x400E2164,__READ       ,__can_msgv2_bits);
__IO_REG32_BIT(CCAN0_CLKDIV,             0x400E2180,__READ_WRITE ,__can_clkdiv_bits);

/***************************************************************************
 **
 ** CCAN1
 **
 ***************************************************************************/
__IO_REG32_BIT(CCAN1_CNTL,               0x400A4000,__READ_WRITE ,__can_cntl_bits);
__IO_REG32_BIT(CCAN1_STAT,               0x400A4004,__READ_WRITE ,__can_stat_bits);
__IO_REG32_BIT(CCAN1_EC,                 0x400A4008,__READ       ,__can_ec_bits);
__IO_REG32_BIT(CCAN1_BT,                 0x400A400C,__READ_WRITE ,__can_bt_bits);
__IO_REG32_BIT(CCAN1_INT,                0x400A4010,__READ       ,__can_int_bits);
__IO_REG32_BIT(CCAN1_TEST,               0x400A4014,__READ_WRITE ,__can_test_bits);
__IO_REG32_BIT(CCAN1_BRPE,               0x400A4018,__READ_WRITE ,__can_brpe_bits);
__IO_REG32_BIT(CCAN1_IF1_CMDREQ,         0x400A4020,__READ_WRITE ,__can_ifx_cmdreq_bits);
__IO_REG32_BIT(CCAN1_IF1_CMDMSK_W,       0x400A4024,__READ_WRITE ,__can_ifx_cmdmsk_bits);
#define CCAN1_IF1_CMDMSK_R      CCAN1_IF1_CMDMSK_W
#define CCAN1_IF1_CMDMSK_R_bit  CCAN1_IF1_CMDMSK_W_bit
__IO_REG32_BIT(CCAN1_IF1_MSK1,           0x400A4028,__READ_WRITE ,__can_ifx_msk1_bits);
__IO_REG32_BIT(CCAN1_IF1_MSK2,           0x400A402C,__READ_WRITE ,__can_ifx_msk2_bits);
__IO_REG32_BIT(CCAN1_IF1_ARB1,           0x400A4030,__READ_WRITE ,__can_ifx_arb1_bits);
__IO_REG32_BIT(CCAN1_IF1_ARB2,           0x400A4034,__READ_WRITE ,__can_ifx_arb2_bits);
__IO_REG32_BIT(CCAN1_IF1_MCTRL,          0x400A4038,__READ_WRITE ,__can_ifx_mctrl_bits);
__IO_REG32_BIT(CCAN1_IF1_DA1,            0x400A403C,__READ_WRITE ,__can_ifx_da1_bits);
__IO_REG32_BIT(CCAN1_IF1_DA2,            0x400A4040,__READ_WRITE ,__can_ifx_da2_bits);
__IO_REG32_BIT(CCAN1_IF1_DB1,            0x400A4044,__READ_WRITE ,__can_ifx_db1_bits);
__IO_REG32_BIT(CCAN1_IF1_DB2,            0x400A4048,__READ_WRITE ,__can_ifx_db2_bits);
__IO_REG32_BIT(CCAN1_IF2_CMDREQ,         0x400A4080,__READ_WRITE ,__can_ifx_cmdreq_bits);
__IO_REG32_BIT(CCAN1_IF2_CMDMSK_W,         0x400A4084,__READ_WRITE ,__can_ifx_cmdmsk_bits);
#define CCAN1_IF2_CMDMSK_R      CCAN1_IF2_CMDMSK_W
#define CCAN1_IF2_CMDMSK_R_bit  CCAN1_IF2_CMDMSK_W_bit
__IO_REG32_BIT(CCAN1_IF2_MSK1,           0x400A4088,__READ_WRITE ,__can_ifx_msk1_bits);
__IO_REG32_BIT(CCAN1_IF2_MSK2,           0x400A408C,__READ_WRITE ,__can_ifx_msk2_bits);
__IO_REG32_BIT(CCAN1_IF2_ARB1,           0x400A4090,__READ_WRITE ,__can_ifx_arb1_bits);
__IO_REG32_BIT(CCAN1_IF2_ARB2,           0x400A4094,__READ_WRITE ,__can_ifx_arb2_bits);
__IO_REG32_BIT(CCAN1_IF2_MCTRL,          0x400A4098,__READ_WRITE ,__can_ifx_mctrl_bits);
__IO_REG32_BIT(CCAN1_IF2_DA1,            0x400A409C,__READ_WRITE ,__can_ifx_da1_bits);
__IO_REG32_BIT(CCAN1_IF2_DA2,            0x400A40A0,__READ_WRITE ,__can_ifx_da2_bits);
__IO_REG32_BIT(CCAN1_IF2_DB1,            0x400A40A4,__READ_WRITE ,__can_ifx_db1_bits);
__IO_REG32_BIT(CCAN1_IF2_DB2,            0x400A40A8,__READ_WRITE ,__can_ifx_db2_bits);
__IO_REG32_BIT(CCAN1_TXREQ1,             0x400A4100,__READ       ,__can_txreq1_bits);
__IO_REG32_BIT(CCAN1_TXREQ2,             0x400A4104,__READ       ,__can_txreq2_bits);
__IO_REG32_BIT(CCAN1_ND1,                0x400A4120,__READ       ,__can_nd1_bits);
__IO_REG32_BIT(CCAN1_ND2,                0x400A4124,__READ       ,__can_nd2_bits);
__IO_REG32_BIT(CCAN1_IR1,                0x400A4140,__READ       ,__can_ir1_bits);
__IO_REG32_BIT(CCAN1_IR2,                0x400A4144,__READ       ,__can_ir2_bits);
__IO_REG32_BIT(CCAN1_MSGV1,              0x400A4160,__READ       ,__can_msgv1_bits);
__IO_REG32_BIT(CCAN1_MSGV2,              0x400A4164,__READ       ,__can_msgv2_bits);
__IO_REG32_BIT(CCAN1_CLKDIV,             0x400A4180,__READ_WRITE ,__can_clkdiv_bits);

/***************************************************************************
 **
 ** I2S
 **
 ***************************************************************************/
__IO_REG32_BIT(I2S_DAO,                0x400A2000,__READ_WRITE ,__i2s_dao_bits);
__IO_REG32_BIT(I2S_DAI,                0x400A2004,__READ_WRITE ,__i2s_dai_bits);
__IO_REG32(    I2S_TXFIFO,             0x400A2008,__WRITE);
__IO_REG32(    I2S_RXFIFO,             0x400A200C,__READ);
__IO_REG32_BIT(I2S_STATE,              0x400A2010,__READ       ,__i2s_state_bits);
__IO_REG32_BIT(I2S_DMA1,               0x400A2014,__READ_WRITE ,__i2s_dma1_bits);
__IO_REG32_BIT(I2S_DMA2,               0x400A2018,__READ_WRITE ,__i2s_dma2_bits);
__IO_REG32_BIT(I2S_IRQ,                0x400A201C,__READ_WRITE ,__i2s_irq_bits);
__IO_REG32_BIT(I2S_TXRATE,             0x400A2020,__READ_WRITE ,__i2s_rxtxrate_bits);
__IO_REG32_BIT(I2S_RXRATE,             0x400A2024,__READ_WRITE ,__i2s_rxtxrate_bits);
__IO_REG32_BIT(I2S_TXBITRATE,          0x400A2028,__READ_WRITE ,__i2s_txbitrate_bits);
__IO_REG32_BIT(I2S_RXBITRATE,          0x400A202C,__READ_WRITE ,__i2s_rxbitrate_bits);
__IO_REG32_BIT(I2S_TXMODE,             0x400A2030,__READ_WRITE ,__i2s_txmode_bits);
__IO_REG32_BIT(I2S_RXMODE,             0x400A2034,__READ_WRITE ,__i2s_rxmode_bits);

/***************************************************************************
 **
 ** I2C0
 **
 ***************************************************************************/
__IO_REG32_BIT(I2C0_CONSET,            0x400A1000,__READ_WRITE ,__i2c_conset_bits);
__IO_REG32_BIT(I2C0_STAT,              0x400A1004,__READ       ,__i2c_stat_bits);
__IO_REG32_BIT(I2C0_DAT,               0x400A1008,__READ_WRITE ,__i2c_dat_bits);
__IO_REG32_BIT(I2C0_ADR0,              0x400A100C,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C0_SCLH,              0x400A1010,__READ_WRITE ,__i2c_sclh_bits);
__IO_REG32_BIT(I2C0_SCLL,              0x400A1014,__READ_WRITE ,__i2c_scll_bits);
__IO_REG32(    I2C0_CONCLR,            0x400A1018,__WRITE      );
__IO_REG32_BIT(I2C0_MMCTRL,            0x400A101C,__READ_WRITE ,__i2c_mmctrl_bits);
__IO_REG32_BIT(I2C0_ADR1,              0x400A1020,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C0_ADR2,              0x400A1024,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C0_ADR3,              0x400A1028,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C0_DATA_BUFFER,       0x400A102C,__READ       ,__i2c_dat_bits);
__IO_REG32_BIT(I2C0_MASK0,             0x400A1030,__READ_WRITE ,__i2c_mask_bits);
__IO_REG32_BIT(I2C0_MASK1,             0x400A1034,__READ_WRITE ,__i2c_mask_bits);
__IO_REG32_BIT(I2C0_MASK2,             0x400A1038,__READ_WRITE ,__i2c_mask_bits);
__IO_REG32_BIT(I2C0_MASK3,             0x400A103C,__READ_WRITE ,__i2c_mask_bits);

/***************************************************************************
 **
 ** I2C1
 **
 ***************************************************************************/
__IO_REG32_BIT(I2C1_CONSET,            0x400E0000,__READ_WRITE ,__i2c_conset_bits);
__IO_REG32_BIT(I2C1_STAT,              0x400E0004,__READ       ,__i2c_stat_bits);
__IO_REG32_BIT(I2C1_DAT,               0x400E0008,__READ_WRITE ,__i2c_dat_bits);
__IO_REG32_BIT(I2C1_ADR0,              0x400E000C,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C1_SCLH,              0x400E0010,__READ_WRITE ,__i2c_sclh_bits);
__IO_REG32_BIT(I2C1_SCLL,              0x400E0014,__READ_WRITE ,__i2c_scll_bits);
__IO_REG32(    I2C1_CONCLR,            0x400E0018,__WRITE      );
__IO_REG32_BIT(I2C1_MMCTRL,            0x400E001C,__READ_WRITE ,__i2c_mmctrl_bits);
__IO_REG32_BIT(I2C1_ADR1,              0x400E0020,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C1_ADR2,              0x400E0024,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C1_ADR3,              0x400E0028,__READ_WRITE ,__i2c_adr_bits);
__IO_REG32_BIT(I2C1_DATA_BUFFER,       0x400E002C,__READ       ,__i2c_dat_bits);
__IO_REG32_BIT(I2C1_MASK0,             0x400E0030,__READ_WRITE ,__i2c_mask_bits);
__IO_REG32_BIT(I2C1_MASK1,             0x400E0034,__READ_WRITE ,__i2c_mask_bits);
__IO_REG32_BIT(I2C1_MASK2,             0x400E0038,__READ_WRITE ,__i2c_mask_bits);
__IO_REG32_BIT(I2C1_MASK3,             0x400E003C,__READ_WRITE ,__i2c_mask_bits);

/***************************************************************************
 **
 ** ADC0
 **
 ***************************************************************************/
__IO_REG32_BIT(ADC0_CR,                 0x400E3000,__READ_WRITE ,__adc_cr_bits);
__IO_REG32_BIT(ADC0_GDR,                0x400E3004,__READ_WRITE ,__adc_gdr_bits);
__IO_REG32_BIT(ADC0_INTEN,              0x400E300C,__READ_WRITE ,__adc_inten_bits);
__IO_REG32_BIT(ADC0_DR0,                0x400E3010,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR1,                0x400E3014,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR2,                0x400E3018,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR3,                0x400E301C,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR4,                0x400E3020,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR5,                0x400E3024,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR6,                0x400E3028,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_DR7,                0x400E302C,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC0_STAT,               0x400E3030,__READ       ,__adc_stat_bits);

/***************************************************************************
 **
 ** ADC1
 **
 ***************************************************************************/
__IO_REG32_BIT(ADC1_CR,                 0x400E4000,__READ_WRITE ,__adc_cr_bits);
__IO_REG32_BIT(ADC1_GDR,                0x400E4004,__READ_WRITE ,__adc_gdr_bits);
__IO_REG32_BIT(ADC1_INTEN,              0x400E400C,__READ_WRITE ,__adc_inten_bits);
__IO_REG32_BIT(ADC1_DR0,                0x400E4010,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR1,                0x400E4014,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR2,                0x400E4018,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR3,                0x400E401C,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR4,                0x400E4020,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR5,                0x400E4024,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR6,                0x400E4028,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_DR7,                0x400E402C,__READ       ,__adc_dr_bits);
__IO_REG32_BIT(ADC1_STAT,               0x400E4030,__READ       ,__adc_stat_bits);

