una1veritas/Workspace/STM32F4/STM32-E_revB1_demo/Project/Test/arm/inc/NXP/iolpc4310_m4.h
#define PWR_STATE_DEEP_SLEEP      0x003000AA
#define PWR_STATE_POWER_DOWN      0x0030FCBA
#define PWR_STATE_DEEP_POWER_DOWN 0x003FFF7F

#endif    /* __IOLPC4310_M4_H */

/*###DDF-INTERRUPT-BEGIN###
Interrupt0   = NMI            0x08
Interrupt1   = HardFault      0x0C
Interrupt2   = MemManage      0x10
Interrupt3   = BusFault       0x14
Interrupt4   = UsageFault     0x18
Interrupt5   = SVC            0x2C
Interrupt6   = DebugMon       0x30
Interrupt7   = PendSV         0x38
Interrupt8   = SysTick        0x3C
Interrupt9   = DAC            0x40
Interrupt10  = M0CORE         0x44
Interrupt11  = DMA            0x48
Interrupt12  = SDIO           0x58
Interrupt13  = SCT            0x68
Interrupt14  = RITIMER        0x6C
Interrupt15  = TIMER0         0x70
Interrupt16  = TIMER1         0x74
Interrupt17  = TIMER2         0x78
Interrupt18  = TIMER3         0x7C
Interrupt19  = MCPWM          0x80
Interrupt20  = ADC0           0x84
Interrupt21  = I2C0           0x88
Interrupt22  = I2C1           0x8C
Interrupt23  = SPI            0x90
Interrupt24  = ADC1           0x94
Interrupt25  = SSP0           0x98
Interrupt26  = SSP1           0x9C
Interrupt27  = USART0         0xA0
Interrupt28  = UART1          0xA4
Interrupt29  = USART2         0xA8
Interrupt30  = USART3         0xAC
Interrupt31  = I2S0           0xB0
Interrupt32  = I2S1           0xB4
Interrupt33  = SPIFI          0xB8
Interrupt34  = SGPIO          0xBC
Interrupt35  = PIN_INT0       0xC0
Interrupt36  = PIN_INT1       0xC4
Interrupt37  = PIN_INT2       0xC8
Interrupt38  = PIN_INT3       0xCC
Interrupt39  = PIN_INT4       0xD0
Interrupt40  = PIN_INT5       0xD4
Interrupt41  = PIN_INT6       0xD8
Interrupt42  = PIN_INT7       0xDC
Interrupt43  = GINT0          0xE0
Interrupt44  = GINT1          0xE4
Interrupt45  = EVENTROUTER    0xE8
Interrupt46  = C_CAN1         0xEC
Interrupt47  = ATIMER         0xF8
Interrupt48  = RTC            0xFC
Interrupt49  = WWDT           0x104
Interrupt50  = C_CAN0         0x10C
###DDF-INTERRUPT-END###*/
